{"ImdbId": "tt2707408", "reviews": [{"ImdbId": "tt2707408", "reviews": [{"reviewer_name": "ahmetkozan", "reviewer_url": "/user/ur48829349/", "data-review-id": "rw3443679", "short_review": "The Incredible Story of Pablo Escobar", "full_review": "", "review_date": "1 April 2016", "rating_value": "10"}, {"reviewer_name": "katysuarez", "reviewer_url": "/user/ur62385704/", "data-review-id": "rw3307951", "short_review": "Impressive", "full_review": "", "review_date": "30 August 2015", "rating_value": "10"}, {"reviewer_name": "michaelradny", "reviewer_url": "/user/ur25997566/", "data-review-id": "rw3306846", "short_review": "Netflix To The Rescue", "full_review": "", "review_date": "29 August 2015", "rating_value": "10"}, {"reviewer_name": "dblyth-46821", "reviewer_url": "/user/ur101492473/", "data-review-id": "rw4771762", "short_review": "Best show on TV!!", "full_review": "Binged all 3 seasons and Mexico in 2 weeks. It's so good you just can't stop watching!", "review_date": "9 April 2019", "rating_value": "10"}, {"reviewer_name": "RobScott-13", "reviewer_url": "/user/ur6387867/", "data-review-id": "rw5589670", "short_review": "Outstanding!", "full_review": "Narcos is such a great show it's hard to explain just how good it really is. Wagner Moura and Pedro Pescal lead an amazing cast who suck you right into the show. There have been a lot of shows about drug cartels but this is without a doubt the best and it's bit close! It really is addicting once you start watching and you get used the subtitles pretty quick.", "review_date": "29 March 2020", "rating_value": "10"}, {"reviewer_name": "johmil-18374", "reviewer_url": "/user/ur60096640/", "data-review-id": "rw3307129", "short_review": "Fantastic production, we are living in the golden age of series", "full_review": "", "review_date": "29 August 2015", "rating_value": "8"}, {"reviewer_name": "winickj-797-80915", "reviewer_url": "/user/ur46775240/", "data-review-id": "rw3306673", "short_review": "How to do Television right.", "full_review": "", "review_date": "28 August 2015", "rating_value": "9"}, {"reviewer_name": "ahmed73367", "reviewer_url": "/user/ur27900149/", "data-review-id": "rw3306792", "short_review": "It's going to be ''The Hit'' . Beautiful after 3 episodes .", "full_review": "", "review_date": "29 August 2015", "rating_value": "10"}, {"reviewer_name": "hadjigeorgiou-81942", "reviewer_url": "/user/ur62099366/", "data-review-id": "rw3307116", "short_review": "Dark, Real Insight, Mesmerising performance from Wagner Moura.", "full_review": "", "review_date": "28 August 2015", "rating_value": "9"}, {"reviewer_name": "E161TZ", "reviewer_url": "/user/ur90685861/", "data-review-id": "rw4989804", "short_review": "Best series I've seen in a very long time!", "full_review": "Loved it from start to finish. I did not care that I spent most of the time reading English subtitles, this entire series left me wanting and wishing I could speak Spanish. It's simply superb! Not once was I bored, I did not want this to finish, I knew nothing about Pablo's life, but man, what a life he lived. You have to see this to believe it!", "review_date": "11 July 2019", "rating_value": "10"}, {"reviewer_name": "Tomadour", "reviewer_url": "/user/ur0095073/", "data-review-id": "rw3307119", "short_review": "Addicted", "full_review": "Having seen all Padilha movies, I was anxious to see this new Netflix series and had great expectations. He did it again. I cannot stop watching. One episode after another. OK if the cast is not Colombian. But they are all good actors and play the parts very well. I will try to finish this weekend all the episodes but i think there will be more seasons. Best series of the year so far. The action is great. The scenarios are perfect. The 1980's atmosphere is awesome. 10 out 0f 10. I hope they will make more series like that in the future. Good real stories and perfect action and direction. I could not expect less from Padilha.", "review_date": "28 August 2015", "rating_value": "10"}, {"reviewer_name": "thomaslovemydogfaye", "reviewer_url": "/user/ur109060464/", "data-review-id": "rw5549165", "short_review": "One of the better shows on Netflix", "full_review": "Season 2 was better then season 1 in my opinion of the Pablo Escobar timeline, the acting is very great and Wagner Moura does a fantastic job of playing such a complex character. Took some getting used to watching a series that is 80% Spanish with English subtitles, but once you get used to it the levels of suspense towards the end of season 1 and season 2 are easily what made this an addictive series", "review_date": "14 March 2020", "rating_value": "9"}, {"reviewer_name": "paul_marston", "reviewer_url": "/user/ur34842630/", "data-review-id": "rw3308111", "short_review": "A reason to subscribe to Netflix", "full_review": "", "review_date": "31 August 2015", "rating_value": "9"}, {"reviewer_name": "metintomas-63822", "reviewer_url": "/user/ur101927626/", "data-review-id": "rw5499087", "short_review": "best ever", "full_review": "This is netflix's most elite and uncompromising show ever. The show did not change because of money netflix should hold on to this kinda shows", "review_date": "21 February 2020", "rating_value": "10"}, {"reviewer_name": "guruprakash-88986", "reviewer_url": "/user/ur84296128/", "data-review-id": "rw5503545", "short_review": "Highly Addictive As Cocaine !!", "full_review": "Watched this Series in very short time and it is Highly Addictive As Cocaine !! Agent Peña, Murphy, Pablo Escobar and Cali Cartel simply Verithanam 💥💥", "review_date": "23 February 2020", "rating_value": ""}, {"reviewer_name": "Ed-Shullivan", "reviewer_url": "/user/ur31328960/", "data-review-id": "rw5745721", "short_review": "Just the facts mam", "full_review": "", "review_date": "17 May 2020", "rating_value": "9"}, {"reviewer_name": "leftbanker-1", "reviewer_url": "/user/ur20309759/", "data-review-id": "rw3307091", "short_review": "Netflix Has Yet Another Triumph", "full_review": "", "review_date": "29 August 2015", "rating_value": "10"}, {"reviewer_name": "nanlinanshe", "reviewer_url": "/user/ur112258506/", "data-review-id": "rw5398008", "short_review": "a great documentary of the era of magic and realism", "full_review": "Some thoughts after watching two Narcos seasons. This TV series is great not just because it illustrates to us the most significant era of drug traffickers, as a documentary; the narration of the whole story also shows respect to Magical realism style, which also originated from Colombia. Things could happen to shock you in every second, far beyond normality and your expectation, but in the context, they seem to make perfect sense as for that time, in that place, with those people who were born in a world where nothing is expectable.\nFor me, the \"realism\" attracts my deep thinking all the time while I watch the series. Pablo Escobar is definitely one of the focused character, and he is surely vicious, ambitious and cruel and one would not describe him as a \"normal guy\". But quite a lot of scenes showed me a different part of such an evil criminal that contradicts with his apparent impression, especially when we see how he values loyalty, how much he loves his wife and children, how he would try all possible or impossible to protect and insure his family members' wellbeing. In these moments, his image seems a bit different and, seems a bit hard to say, he shows his good, sweet and normal side as being a human.\nThis kind of dramatic effect is emphasized in S01E09, when Pablo had to stayed in his father's house to temporarily avoid police chasing. This episode leaves me the deepest impression and I would like to talk more about it. When old Escobar accidently got blood on Pablo's shirt and ironically commented: Funny that you don't like blood. Here I saw one of the greatest acting in the series, when the toughly maintained, fragile father and son relationship finally broke down at the moment, or as it already did many years ago when their interest and value distinct from each other's. Pablo surely desired to be a great man, he thought and wished his outstanding power and wealth would make his father proud of him, for they are no longer the poor and insignificant mud that can be stepped on by the superior, for tomorrow's food and cloth is no longer a concern. But at the end of the day, his father is ashamed, disappointed, regretful; more than any fathers in the world and Pablo learned this truth finally. When I watched season 2, Pablo's failing is gradual, with his drug kingdom teared down piece by piece; but it is also in a flash, when something that you would not expect to matter at all for someone ruthless like this, finally breaks his fortress and ambition. Very dramatic and like a magic, all is gone like wind, all is left is a tired, aged bulky guy who found his great deeds meaningless and his ambition, vanished. I also see how he might start with a small ambition, gaining a bit more respect and money, until greediness and power overtakes him, which is followed by supreme victory, and equally significant burst of his dream in the bubble. But Pablo's death will never mark the end of all these, \"dreamers\" would keep sprouting one after the other on this land, watered by the constant rain and inequality on this land.\nIn some way the story coincides with the cycle of Buendia's family under Macondo's pen, constant repetition of one's fate despite the struggle and fight, as it is determined, the reality.\nIf you ask me to define magic, I would just say, it is something that surprise you. Agent Steve describe it as a disappearance magic when Peña was asked to return to USA. The same for me when Colonel Martinez, someone I really like, was dead and gone all of a sudden, without any time or signal for you to get ready. I once thought he is an important role and won't die easily and the show just hit me for being naïve. Yep, the war is fair in this way, everyone is made of fresh and blood and no one is more significant than the others, when it's time for you to die, you will.", "review_date": "11 January 2020", "rating_value": "10"}, {"reviewer_name": "martinraggett182-564-31246", "reviewer_url": "/user/ur38968570/", "data-review-id": "rw5126042", "short_review": "One of the best series ever!", "full_review": "10/10 for acting, filming, sticking to the true facts. Series 1 and 2 are a must watch.", "review_date": "17 September 2019", "rating_value": "10"}, {"reviewer_name": "mccoycfo-921-273218", "reviewer_url": "/user/ur50593504/", "data-review-id": "rw4469478", "short_review": "One of the best shows ever made!", "full_review": "So I read some negative reviews that have, primarily, two complaints about this series. The biggest is the need for subtitles. These people are infants in my opinion. The use of the native language in this series lends to its immersive nature and authenticity to this show and would be a vital missing component if done completely in english. The second is that it glorifies violence and criminal activity. It is a docudrama people. The story is told, to the best of it's ability, as it happened. Again, I feel these people are infants that probably watch reality television as their primary entertainment consumption. This show is excellent in every way. Production quality, awesome locations, beautiful cinamotography, absolutely top notch acting and script writing that is sublime. No documentary series in televison history has gripped me like this show. I would highly encourage that anyone who hasnt seen it yet, remedy that fact as soon as possible. I have never reviewed anything on IMDB before, but my wish for this show to stay alive and well has made me post this. Happy viewing!", "review_date": "20 November 2018", "rating_value": "10"}, {"reviewer_name": "lagunaedm", "reviewer_url": "/user/ur76015347/", "data-review-id": "rw5499369", "short_review": "Amazing", "full_review": "Best show in its category for sure. I usually don't like watching movies/shows like this, neither was I interested in the story at all which is why it's taken me till 2020 to give it a chance. All I can say is this show is amazing, there is so much depth to all the characters. It's amazing how they managed to put a story together so well, especially one I had no interest in. Somehow it pulled me in. Whoever directed this should teach a lesson to all the other clown directors in Hollywood on how to develop characters and tell a story properly. Adding the fact this is all based on a fairly accurate true story, I give this 10/10. First time I've ever given any show/movie a 10/10.", "review_date": "21 February 2020", "rating_value": "10"}, {"reviewer_name": "jennirose-513-67000", "reviewer_url": "/user/ur37307361/", "data-review-id": "rw5372523", "short_review": "Brilliant series ...", "full_review": "I binged watched Season 1-3 in a few weeks . Quite honestly this is truly a eye opening look in to the world of Cartel families . Nothing is more terrifying and captivating than this look into history . The rise and fall of these families is almost too much to handle. The ripple effect of drugs, money and power can only lead to one thing . The ruthlessness of endless power is something you simply can never understand . The acting is worthy and brilliant. I wanted to see the good guys prevail . The line between good vs evil is mighty foggy towards the end. Unfortunately the tragedy of it all can never be fully shown . Glamorizing these ruthless killers makes for one excellent series .", "review_date": "1 January 2020", "rating_value": "10"}, {"reviewer_name": "ljubomir_paparov", "reviewer_url": "/user/ur28407392/", "data-review-id": "rw3306813", "short_review": "Spectacular", "full_review": "", "review_date": "29 August 2015", "rating_value": "10"}, {"reviewer_name": "razfast", "reviewer_url": "/user/ur63855671/", "data-review-id": "rw5680826", "short_review": "Fantastic!", "full_review": "What a show, must say this is a top top show and a proper insight of how things went on the drug's end, but my favourite season has to be season 3, all action non stop, just epic!", "review_date": "26 April 2020", "rating_value": "10"}, {"reviewer_name": "omarchahad", "reviewer_url": "/user/ur51371263/", "data-review-id": "rw3307122", "short_review": "Jose Padilha is back baby", "full_review": "When Padilha bring to us Robocop reboot I was really sad to see one of the greatest mind in show business just vanish. I recently see a interview when he move out to Los Angeles, because Brazil become dangerous to he an his family, consequence of his movies about dirt Brazilian cops, and he have been attack on his studio back in Rio De Janeiro, and now I see he was right, he did again, the great Jose Padilhais back. I love Wagner Moura, and all the scenes of Pablo Escobar is just amazing. Resuming, this series is solid, just another Breaking Badlike, but with new stuff and Padilha's scenes, AMAZING! Jus watch this amazing show, too realistic and fun...", "review_date": "28 August 2015", "rating_value": "10"}]}, {"ImdbId": "tt2707408", "reviews": [{"reviewer_name": "ardaozturk035", "reviewer_url": "/user/ur108894035/", "data-review-id": "rw5427462", "short_review": "Incredible Pablo Escobar Story", "full_review": "Excellent Job well done Netflix Narcos is amazing series acting action is very good must watch 10/10", "review_date": "22 January 2020", "rating_value": "10"}, {"reviewer_name": "magneghost", "reviewer_url": "/user/ur118343503/", "data-review-id": "rw5733882", "short_review": "A total gem in Netflix", "full_review": "", "review_date": "13 May 2020", "rating_value": "9"}, {"reviewer_name": "rhff-56252", "reviewer_url": "/user/ur67569363/", "data-review-id": "rw5452489", "short_review": "Top Netflix series", "full_review": "Wonderful how it tell us life story of Pablo Escobar", "review_date": "1 February 2020", "rating_value": "10"}, {"reviewer_name": "leonaskulesovas", "reviewer_url": "/user/ur55604505/", "data-review-id": "rw4335216", "short_review": "Thought better", "full_review": "Very inaccurate... if you read his lovers book or listen his sons story then you know that this tv series doesn't show how really cruel and merciless Escobar was.", "review_date": "12 September 2018", "rating_value": "5"}, {"reviewer_name": "clarnoah", "reviewer_url": "/user/ur119919779/", "data-review-id": "rw6524310", "short_review": "incredible. captivating. beautiful.", "full_review": "Wagner moura steals the show as escobar. as a brazilian, wagner's native language is portuguese. as a colombian, escobar's was spanish. so, wagner decided to spend over a year learning spanish. for one role. and he nails it, that's dedication. wagner is a treat to see and his portrayal of pablo pulls you in. and that isn't to say he is the only gifted actor here. holbrook and pascal were fantastic as murphy and peña. everyone was great, really. pablo's sicarios, the cops,etc etc etc. not one actor felt out of place. the beautiful cinematography in an already gorgeous country, if nothing else, is reason alone to watch. stop reading reviews trying to figure out what to watch next. watch narcos now, it's a treat.", "review_date": "25 January 2021", "rating_value": "10"}, {"reviewer_name": "egerermike", "reviewer_url": "/user/ur128406111/", "data-review-id": "rw6503753", "short_review": "10/10 season 1&2 8/10 season 3", "full_review": "Intense, exciting, great acting, great settings. Not boring at any time.", "review_date": "19 January 2021", "rating_value": "9"}, {"reviewer_name": "trish-64", "reviewer_url": "/user/ur3575599/", "data-review-id": "rw3834841", "short_review": "OK but not unmissable", "full_review": "Narcos is OK kinda-sorta, but I'm not sure I'll be watching any more, having just got to the end of the first series. First, the plus points: excellent camera-work - the DPs on this are great. And Wagner Moura has a ton of presence on screen. Negative points: way too much narration, which distances the viewer from the action and is also very uncinematic - half the time it's telling you what you can see already. Lead actor Boyd Holbrook is dreadful and has zero presence on screen. No time is really taken to flesh out the subsidiary characters, unlike in - say - The Sopranos, where each one of these dreadful people was fully rounded with good points and flaws. And finally, there is way too much sex that exists purely to get some breasts on camera to titillate male viewers (witness the scene between Moncada and his wife in the bath, which could just as easily have been done at the breakfast table). As a woman, I hate to see women's bodies used in this way. I've come at this series from The Americans, where I looked forward, every evening, to the next instalment with excitement and anticipation. Narcos I can very much take or leave.", "review_date": "18 October 2017", "rating_value": "6"}, {"reviewer_name": "DennisBergkamp10", "reviewer_url": "/user/ur28682936/", "data-review-id": "rw5560037", "short_review": "I should have watched it sooner.", "full_review": "", "review_date": "18 March 2020", "rating_value": "8"}, {"reviewer_name": "hitman-18300", "reviewer_url": "/user/ur42767705/", "data-review-id": "rw4227321", "short_review": "US gov Propaganda", "full_review": "", "review_date": "5 July 2018", "rating_value": "3"}, {"reviewer_name": "refordgarry", "reviewer_url": "/user/ur45504871/", "data-review-id": "rw6018011", "short_review": "Truly Yummy Bi-lingual Dramatized History", "full_review": "Had a job killing the subtitles, but you'll never master Latin dialects if you don't. Pity they could not get a real Chilean actor to play La Cucaracha, since he'd been taught only how to curse. Then again with El Contador of Series 3, raised closer to Santiago, Cuba than the Andean capital. And that's why Latin commentators look down on \"Gringos\" - because the same US studio that would die than portray a Welsh person as New York gangster would happily mix-n-match Latinos like candies - Wrong!. Those points aside this was a super-good series, that even survived our most beloved villain, Pablo Escobar into a final Series. I think most audience in Series 1-2 were really rooting for Pablo. Excellent.", "review_date": "22 August 2020", "rating_value": "8"}, {"reviewer_name": "steamfritz", "reviewer_url": "/user/ur75919301/", "data-review-id": "rw5699482", "short_review": "Stunning show and a must watch", "full_review": "The show doesnt get boring for a single second. Especially the first 3 seasons were abselutely stunning, you get to know interesting characters and the story line catches you after 2 episodes. Definitely a must watch.", "review_date": "2 May 2020", "rating_value": "10"}, {"reviewer_name": "seanmartin1967", "reviewer_url": "/user/ur42327651/", "data-review-id": "rw5516055", "short_review": "Top notch drama.", "full_review": "", "review_date": "28 February 2020", "rating_value": "9"}, {"reviewer_name": "gibbs-18172", "reviewer_url": "/user/ur103624323/", "data-review-id": "rw5486161", "short_review": "Engaging throughout", "full_review": "", "review_date": "15 February 2020", "rating_value": "10"}, {"reviewer_name": "kirchuchannel", "reviewer_url": "/user/ur108806161/", "data-review-id": "rw5226499", "short_review": "The Best Show on Netflix", "full_review": "I was not even aware of this show and would not have watched this had it not been recommended by a friend. I started watching season 1 on Friday night and completed both season 1 and 2 by end of Saturday. When Season 3 was released on Netflix I binge watched and completed in 1 sittings. It is so addictive that I have watched season 1 to 3 almost 5 times already. People who bad mouth this show or give less rating are simply jealous of its success. I agree that Native Colombians may not like for the fact that the leading character is done by a non-spanish speaking and some left leaning people might be offended by the portrayal of M19 terrorist group. For me the acting is top class , the Production value is 1st rate and the writing and direction is simply outstanding and top it all the background music is comparable to Spaghetti westerns.", "review_date": "31 October 2019", "rating_value": "10"}, {"reviewer_name": "peterrichboy", "reviewer_url": "/user/ur73908325/", "data-review-id": "rw3748519", "short_review": "Outstanding drama", "full_review": "Living in the U.K. We new very little of Americas war on drugs. I remember President Reagan talking about it but I had no idea of the scale involved. Watching this superb series had me in total disbelief. The amount of drugs, the lengths and organization the cartels took to get the drugs into the USA, and the staggering sums of money these dealers made. But most of all the incredible human sacrifices by both the U.S. and Colombian police forces made to beat the cartels. At times it was a losing battle such was the power of the drug lords throughout Columbia. Narcos cleverly mixes real news footage from the time with the drama at times extremely violent but always compelling. Narcos is quite simply one of the finest shows of recent years.", "review_date": "7 July 2017", "rating_value": "10"}, {"reviewer_name": "Tweekums", "reviewer_url": "/user/ur13977076/", "data-review-id": "rw5557059", "short_review": "A dramatized account of the rise and fall of the Colombian drug cartels", "full_review": "", "review_date": "17 March 2020", "rating_value": "9"}, {"reviewer_name": "likedeeler", "reviewer_url": "/user/ur1686290/", "data-review-id": "rw3367361", "short_review": "Great story, gone to waste", "full_review": "", "review_date": "6 December 2015", "rating_value": "3"}, {"reviewer_name": "cnab", "reviewer_url": "/user/ur62426399/", "data-review-id": "rw3313087", "short_review": "Unnecessary Distorted Story Facts", "full_review": "", "review_date": "2 September 2015", "rating_value": "3"}, {"reviewer_name": "brijeshvaghani", "reviewer_url": "/user/ur76571463/", "data-review-id": "rw4620149", "short_review": "Must watch web series!!!", "full_review": "First of all i am writing this review on the basis of the direction, acting. I am not writing this on basis of story because i am an Indian and i do not know what actually happened at Columbia. And i read some of the guys have wrote that series name 'El patron del mal' is better than this and i didn't watch that so i can't compare but this series is worth watching. the environment and mind set have been created while watching it is more than awesome. Just combination of extra ordinary acting and direction. Must watch guys one of the greatest best web series ever.", "review_date": "1 February 2019", "rating_value": "10"}, {"reviewer_name": "user-895-587379", "reviewer_url": "/user/ur49798927/", "data-review-id": "rw3309349", "short_review": "Starts of good ends up being a propaganda piece.", "full_review": "This show starts of really well, directing is great, acting is great. No complaints at first, in fact I was thinking a 10 out of 10, that's how pleasantly surprised I was. I must say it sucked me in and I got hooked before I knew what the goal of the show was. And there is is a goal and its not a good one. Unfortunately this show is a (as we have learned before) a perfectly designed propaganda piece trying to push a agenda (for you guessed it who). I would not necessarily have a problem with this if it was honest right from the get go but it was not. It ends up being a anti socialist, anti communist, anti youth, anti everything progressive piece that in my opinion tries to excuse the atrocities of the US government in South America instead of explain them (if possible). And that for me unfortunately is in excusable and reminds me of once again Zero Dark Thirty, American Sniper, etc. Its a dangerous slippery slope this series continues to take us down and as such I can not in my right heart recommend it.", "review_date": "2 September 2015", "rating_value": "4"}, {"reviewer_name": "schlomo-jones", "reviewer_url": "/user/ur24622549/", "data-review-id": "rw3308301", "short_review": "Enjoyable but Lacking Perspective", "full_review": "", "review_date": "31 August 2015", "rating_value": "6"}, {"reviewer_name": "vpepascoe", "reviewer_url": "/user/ur20969923/", "data-review-id": "rw3307274", "short_review": "A brave attempt at being credible", "full_review": "", "review_date": "29 August 2015", "rating_value": "7"}, {"reviewer_name": "mrdoyle", "reviewer_url": "/user/ur14370827/", "data-review-id": "rw3309884", "short_review": "Sprawling Wide, But Very Shallow.", "full_review": "", "review_date": "2 September 2015", "rating_value": "5"}, {"reviewer_name": "bogus-bogus-one", "reviewer_url": "/user/ur32568896/", "data-review-id": "rw3350559", "short_review": "Cardboard characters and a skewed U.S. perspective", "full_review": "", "review_date": "7 November 2015", "rating_value": "6"}, {"reviewer_name": "Ricardo_Ribeiro", "reviewer_url": "/user/ur23474299/", "data-review-id": "rw3313640", "short_review": "awful manipulation of allegedly truthful events in order to make the American organizations, as usual, the heroes of the story.", "full_review": "", "review_date": "9 September 2015", "rating_value": "6"}]}, {"ImdbId": "tt2707408", "reviews": [{"reviewer_name": "pilar-narvaez", "reviewer_url": "/user/ur40953523/", "data-review-id": "rw3506187", "short_review": "The bad accents and some big mistakes with historic facts damage Narcos", "full_review": "", "review_date": "17 July 2016", "rating_value": "6"}, {"reviewer_name": "dentx-67186", "reviewer_url": "/user/ur62893850/", "data-review-id": "rw3325059", "short_review": "Just wrong...", "full_review": "Before watching this TV show I had already watched the 113 episodes of the original series 'Pablo Escobar, El patron del mal' that was broadcasted on Colombian TV stations a few years ago. I loved the way they told the story and I was impressed by many of the the actors. Specially Andres Parra who plays Pablo. Luckily enough I speak Spanish fluently and had no need for subtitles. Having this to compare with I noticed that the US version of the story, 'Narcos', had changed a lot of important things, had crammed things together and also invented a few new things I had problems believing. For starters the focus of the 'Narcos' is to show how thanks to USA and the work of an American in Colombia they where able to catch Escobar. But they left out the story of people that where really affected by him and the people that really did all the hard work. The Colombian newspapers, journalists, politicians, police and military. Shameful and also boring! The camera-work and cutting etc, and a few of the actors where perfectly OK, just a shame the story is so... wrong!", "review_date": "28 September 2015", "rating_value": "2"}, {"reviewer_name": "lomotil33-617-716551", "reviewer_url": "/user/ur41266848/", "data-review-id": "rw3840062", "short_review": "First two seasons were very good but...", "full_review": "Season 3 relies too much on everything happening just in time. Law enforcement still hasn't figured out how to cover the back doors. That's right, the bad guys have a ton of people after them and they escape by going out the back door. Again and again. There are plenty of other face-palm moments but I think you get the idea. It's a real shame because the first two seasons were quite good.", "review_date": "24 October 2017", "rating_value": "6"}, {"reviewer_name": "moorely", "reviewer_url": "/user/ur66484551/", "data-review-id": "rw5587339", "short_review": "Great show", "full_review": "Great acting, great \"stories\", only complaint would be the subtitles. Poorly timed, often missing complete sentences, or just missing the main content or emotion of the dialogue.", "review_date": "29 March 2020", "rating_value": "8"}, {"reviewer_name": "s3276169", "reviewer_url": "/user/ur49392790/", "data-review-id": "rw3310958", "short_review": "Revisionist history with a side order of self justification", "full_review": "", "review_date": "4 September 2015", "rating_value": "6"}, {"reviewer_name": "escctrlshift", "reviewer_url": "/user/ur67566154/", "data-review-id": "rw3794812", "short_review": "Season 3: Again a Magnificent, Heart-Wrenching Production", "full_review": "", "review_date": "1 September 2017", "rating_value": "10"}, {"reviewer_name": "actuallygenia", "reviewer_url": "/user/ur119906956/", "data-review-id": "rw5834274", "short_review": "MORE ADDICTIVE THAN ESCOBAR'S COCAIN!", "full_review": "I didn't expect this show to be that good. Still in Season 2 though. I remember when I was at the end of season 1, I was like \"wait, that's it? Did I just finished the 1st season?\" I mean, seriously the storyline is so complex and solid. It stays like that until the very end. Every single scene are worth to watch and never get me bored.", "review_date": "18 June 2020", "rating_value": "10"}, {"reviewer_name": "amrikcooper", "reviewer_url": "/user/ur25933070/", "data-review-id": "rw3466819", "short_review": "Completely overrated, objectively mediocre TV show", "full_review": "", "review_date": "9 May 2016", "rating_value": "4"}, {"reviewer_name": "ajdbarros", "reviewer_url": "/user/ur1252439/", "data-review-id": "rw3350461", "short_review": "Boring", "full_review": "", "review_date": "7 November 2015", "rating_value": "3"}, {"reviewer_name": "rodcollins", "reviewer_url": "/user/ur62376783/", "data-review-id": "rw3307780", "short_review": "Disappointed", "full_review": "", "review_date": "30 August 2015", "rating_value": "3"}, {"reviewer_name": "emirhankos", "reviewer_url": "/user/ur100548096/", "data-review-id": "rw5376563", "short_review": "Good series", "full_review": "I spend a good time until Pablo escobar dies, which means that 2 Stars are gone.", "review_date": "3 January 2020", "rating_value": "8"}, {"reviewer_name": "Dreamchaser721", "reviewer_url": "/user/ur28285144/", "data-review-id": "rw3597255", "short_review": "Never get to that point where you feel\" this is why this is one of the popular show right now\"", "full_review": "They did wrong by manipulating true story with US perspective of narration,unnecessary drama,not suitable actors and no proper justification to the loyalty of \"sicarios\" towards Pablo.This show starts promising but goes downhill continuously towards the end of the season.The second season is outright boring and only fanboys can enjoy it.All women are beautiful and sexy to get more audience to this show.There is no proper line between truth and fiction in this series.And making another two seasons out of this is pathetic attempt.Writing needs to be improved.People in power are shown powerless whether that is true or they made it so to elongate the story only God knows.This is nowhere near to modern day classic.But I should congratulate them for this attempt.They tried hard but it didn't cut out.", "review_date": "12 December 2016", "rating_value": "7"}, {"reviewer_name": "sevalunsan", "reviewer_url": "/user/ur31383226/", "data-review-id": "rw3800054", "short_review": "Narcos Review", "full_review": "", "review_date": "7 September 2017", "rating_value": "10"}, {"reviewer_name": "Lord_Orson", "reviewer_url": "/user/ur6042724/", "data-review-id": "rw3439799", "short_review": "Narcos Season 1 Review", "full_review": "", "review_date": "27 March 2016", "rating_value": "7"}, {"reviewer_name": "somzer", "reviewer_url": "/user/ur53774815/", "data-review-id": "rw3559303", "short_review": "Uninteresting", "full_review": "", "review_date": "10 October 2016", "rating_value": "1"}, {"reviewer_name": "mindra-86686", "reviewer_url": "/user/ur91410995/", "data-review-id": "rw5821646", "short_review": "Mesmerizing", "full_review": "Captivating! I wouldn't be exaggerating if I say it is the best of Netflix Originals. The rise and subsequent fall of Pablo Escobar and the game of Cat and Mouse with DEA, rampant corruption in the government, and the love of his mercenaries for their \"El patron\" was surely a delight to the eyes.\nThe third season featuring Cali Cartel is also good, though according to me, not at par with the previous two seasons.", "review_date": "13 June 2020", "rating_value": "9"}, {"reviewer_name": "antodellomo", "reviewer_url": "/user/ur116190282/", "data-review-id": "rw5658300", "short_review": "My favorite", "full_review": "Great acting, amazing landscape of Colombia, just enjoy all the episodes this series is absolutely amazing. Nothing else to add.", "review_date": "20 April 2020", "rating_value": "10"}, {"reviewer_name": "daveym-649-444962", "reviewer_url": "/user/ur42351091/", "data-review-id": "rw5647221", "short_review": "Everythng you need to know", "full_review": "Amazing performances from all cast members which left me feeling I was watching the actual individuals in a documentary.\nExtraordinary story, held up by extraordinary performances telling the story of a life that is almost unbelievable - except we know it all happened. Make sure you watch it!", "review_date": "17 April 2020", "rating_value": "10"}, {"reviewer_name": "mayankrawatrke", "reviewer_url": "/user/ur93064505/", "data-review-id": "rw5497119", "short_review": "Thrilling...Suspenseful..Addictive", "full_review": "Angel miguel Felix gallardo won hearts Worldwide more than Breslin walt...", "review_date": "20 February 2020", "rating_value": ""}, {"reviewer_name": "Sudherson-V", "reviewer_url": "/user/ur13396139/", "data-review-id": "rw5352711", "short_review": "Obsessed", "full_review": "The narco war story telling with dramatized facts and footages is marvelous. Pena steals the show with his stoic nature, careful, planning, executing missions. I've watched the 3 seasons twice already.", "review_date": "25 December 2019", "rating_value": "9"}, {"reviewer_name": "oguzmeric13", "reviewer_url": "/user/ur31637149/", "data-review-id": "rw5308141", "short_review": "Best series I have watched in my whole life", "full_review": "Amazing biography of Pablo Escobar. I will never forget it.", "review_date": "8 December 2019", "rating_value": "10"}, {"reviewer_name": "jennparis-05929", "reviewer_url": "/user/ur107796015/", "data-review-id": "rw5232256", "short_review": "Would recommend", "full_review": "Was not the kind of show I would normally watch but I'm glad I gave it a try. Very hard to follow at first but once you get sucked in your in! I did feel bad for Pablo Escobar at times, but I'm assuming the show wanted the audience to know that maybe he was a good guy but made very poor decisions. Either way it was good! Season two was alright, very good actors/actresses.", "review_date": "3 November 2019", "rating_value": "8"}, {"reviewer_name": "theernesto", "reviewer_url": "/user/ur109335635/", "data-review-id": "rw5224850", "short_review": "great show", "full_review": "Love this show. I think you should watch it. thanks", "review_date": "31 October 2019", "rating_value": "10"}, {"reviewer_name": "larasmolek", "reviewer_url": "/user/ur108289678/", "data-review-id": "rw5169481", "short_review": "Amazing story!", "full_review": "One of the best series I've ever watched! The tension that accompanies the action throughout the season. The series won me from the first episode and has become an addiction.\nMaybe the first two seasons are better because of Pablo, but the third is certainly interesting. I really like series/movies based on real events, that's why I was impressed by the series.", "review_date": "7 October 2019", "rating_value": "10"}, {"reviewer_name": "josephfecht", "reviewer_url": "/user/ur32129302/", "data-review-id": "rw5160247", "short_review": "Entertaining.", "full_review": "Great show from season 1 to 3. Season 3 was my favorite.", "review_date": "4 October 2019", "rating_value": "9"}]}, {"ImdbId": "tt2707408", "reviews": [{"reviewer_name": "vijayabalanm", "reviewer_url": "/user/ur54150624/", "data-review-id": "rw5159002", "short_review": "One of the Best Ever", "full_review": "Loved it. Definitely one of the best tv show ever made.", "review_date": "3 October 2019", "rating_value": "10"}, {"reviewer_name": "nitinexcel", "reviewer_url": "/user/ur98231708/", "data-review-id": "rw5154544", "short_review": "Fun fact", "full_review": "One of the best series over which you can spend your whole nights watching it.\nThe funfact of you're an Indian then you'll also enjoy its hindi version on Netflix.", "review_date": "1 October 2019", "rating_value": "9"}, {"reviewer_name": "nowackiandrew", "reviewer_url": "/user/ur86677422/", "data-review-id": "rw5132999", "short_review": "I agree with the other reviews - awesome series", "full_review": "Fast paced, great cinematography and acting, keeps me engaged the whole time. If this were a movie I would rate it a 9 as well. It's that good. Some other Netflix series are hit and miss in my opinion but this one is awesome. I am only in season 1 but I am binge watching it.", "review_date": "21 September 2019", "rating_value": "9"}, {"reviewer_name": "mohammedsulemanbalwar", "reviewer_url": "/user/ur101210073/", "data-review-id": "rw5090994", "short_review": "Drugs Dealer", "full_review": "", "review_date": "31 August 2019", "rating_value": "9"}, {"reviewer_name": "ashwanipanwar-58516", "reviewer_url": "/user/ur106951100/", "data-review-id": "rw5076086", "short_review": "Best netflix series till date", "full_review": "If you haven't seen it yet then go for it . I m assuring you that you will not get bored not even for a single minute. A must watch for netflix lovera", "review_date": "23 August 2019", "rating_value": "10"}, {"reviewer_name": "snkkylo", "reviewer_url": "/user/ur93962916/", "data-review-id": "rw5071466", "short_review": "Great!", "full_review": "It is one of the best Crime show, First season was Little bit Boring and some people just give up after One Two episodes because they couldn't get into the show, but if they watch Build-up patently then their Patience will be paid off. Season 2 was So epic and Intense that I felt like I'm on BrBa season 5.\nThe only complain I've about this show is, it has Unnecessary amount of Nudity, I want to see this show while Traveling but I Couldn't because of Nudity.", "review_date": "20 August 2019", "rating_value": "9"}, {"reviewer_name": "harshalsaiyam", "reviewer_url": "/user/ur94321369/", "data-review-id": "rw5035116", "short_review": "You'll in love with the characters.", "full_review": "I really admire the character of agent Javier Pena, and Pablo Escobar's character , they really do the justice with their character. They both have done a spectacular work. And after this series now I am a huge fan of Padro Pascal and Wagner Moura.", "review_date": "2 August 2019", "rating_value": "10"}, {"reviewer_name": "aleksagrobar", "reviewer_url": "/user/ur98890303/", "data-review-id": "rw5011978", "short_review": "BRILLIANT!", "full_review": "I was thinking what rate to give and i decided to give maximum. Why?\nFirst series is very great. It is based on real story of Pablo Escobar and Medellin cartel in first and second season and Cali cartel in third season. Like it writes every time on begging of every episode, some details are not true, so its okay, but the main things are and it was really interesting. It was so interesting and i am now reading a book about Pablo Escobar.\nOne of my favourite so far, congroulations!", "review_date": "22 July 2019", "rating_value": "10"}, {"reviewer_name": "khaloudjack", "reviewer_url": "/user/ur101835130/", "data-review-id": "rw4994582", "short_review": "Narcos", "full_review": "If you are looking for something based on a true story this is the TV show for you. Very goof acting and gives you an inside depth of the history of the south American region", "review_date": "14 July 2019", "rating_value": "10"}, {"reviewer_name": "martim-25819", "reviewer_url": "/user/ur104435639/", "data-review-id": "rw4937352", "short_review": "Amazing", "full_review": "The first two seasons are brutal but I was a little bit disappointed with the last season tbh.", "review_date": "15 June 2019", "rating_value": "9"}, {"reviewer_name": "awalenezi", "reviewer_url": "/user/ur67482541/", "data-review-id": "rw4937348", "short_review": "Nothing to say except, remarkable!", "full_review": "Narcos incredibly uplifted the game! Seriously, there is nothing to say except, remarkable!", "review_date": "15 June 2019", "rating_value": "10"}, {"reviewer_name": "y-mark", "reviewer_url": "/user/ur31587464/", "data-review-id": "rw4935014", "short_review": "Just can't get enough!", "full_review": "", "review_date": "14 June 2019", "rating_value": "10"}, {"reviewer_name": "outispolytropos", "reviewer_url": "/user/ur60601601/", "data-review-id": "rw4540966", "short_review": "Nice", "full_review": "Season One: 8 out of 10.\nSeason Two: 7 out of 10.\nSeason Three: 6 out of 10.", "review_date": "28 December 2018", "rating_value": "7"}, {"reviewer_name": "yashdubey-84644", "reviewer_url": "/user/ur123134484/", "data-review-id": "rw6789090", "short_review": "A good thriller genre", "full_review": "The series mainly foncuses on pablo Escobar's drug life and events after his death.... One of thr best screenplays that I've ever seen, from performance to pacing this series keeps u hooked. Majority dialogue of this series are in spanish so u have to aplly subtitles... They could've shown the rise of pablo Escobar before becoming a drug Lord.....", "review_date": "7 April 2021", "rating_value": "9"}, {"reviewer_name": "hamutal", "reviewer_url": "/user/ur57661743/", "data-review-id": "rw4290885", "short_review": "Docuseries", "full_review": "It's an interesting documentary but horrible as a drama series. I don't know why they categorize it under drama - it's a narrated docuseries like they do in History channel. This is not what I expect in a dramatic storytelling. In fact, it's completely undramaric - no conflict, no rounded characters. They tell you everything (in a very annoying narration btw) instead of showing them through the human story. I gave it 5 because it's a decent documentary. That's it !", "review_date": "18 August 2018", "rating_value": "5"}, {"reviewer_name": "haseeb-riaz88", "reviewer_url": "/user/ur30359763/", "data-review-id": "rw3807554", "short_review": "What a treat, Qué lujo", "full_review": "", "review_date": "17 September 2017", "rating_value": "10"}, {"reviewer_name": "inspektorr", "reviewer_url": "/user/ur20498393/", "data-review-id": "rw3308313", "short_review": "Goodfellas meets The Wire meets The Wolf of Wall Street", "full_review": "", "review_date": "31 August 2015", "rating_value": "10"}, {"reviewer_name": "siddharthubale", "reviewer_url": "/user/ur84487484/", "data-review-id": "rw4998407", "short_review": "In my openion", "full_review": "Story was good till pablo's death not interested in 3 rd season ....", "review_date": "16 July 2019", "rating_value": "9"}, {"reviewer_name": "mariaarangonavia", "reviewer_url": "/user/ur24771435/", "data-review-id": "rw3343129", "short_review": "Views as a Colombian", "full_review": "Maybe you've heard many Colombians complain about these types of series being the only thing that represents our country worldwide. And I agree. I hate that in television the only time people refer to Colombia is in relation to drugs and narcotraffic. But that is not the thing that bothers me the most. It is the fact that while movies and series can talk about this subject, because unfortunately it indeed happened, they do so without the minimum knowledge about our country's culture and delicate history. I can't tell you how many times I've seen the portrayal of my country as a place where apparently cities are very poor villages, and all the people living in them have Mexican accents regardless if they are from Bogotá, Medellin or Cartagena (yes, all of these cities have different accents. Very different ones.) And apparently we are a people waiting for the Americans to save us from ourselves. So when Narcos was released I was reluctant to watch the series. I didn't want to see one more single Hollywood-style show about my country. It wasn't until I read an article of a Colombian guy talking about this series, that I decided to establish my own opinion about it. I've only watched the first six episodes and I have to say is not as bad as I expected. I respect the fact that the producers of this show took the time to study our history and the events that have happened, to make an accurate series about the terrible times Colombia has gone through, and I am thankful for that. I know all the actors are not Colombian, heck even the main character is from Brazil, and I know the accents are not even close to what they should be, but at least it doesn't fall under the category \"just another show about 'Colombia'.\" However, there were things that bothered me. The show is not 100% accurate, and many scenes are very dramatized because after all, it's still Hollywood, and the acting along with the lines of some characters are not the best. But the main problem is how a show that tries to work so close with the actual history, runs through it as if they had a time limit. Some of the most important events in Colombia, such as The Palace of Justice's siege, were shown lightly, without giving them the tremendous importance that they actually had. This just makes me question if the show is really about what happened here, or about how the U.S \"saved us all.\"", "review_date": "25 October 2015", "rating_value": "6"}, {"reviewer_name": "jschultz-57607", "reviewer_url": "/user/ur85233185/", "data-review-id": "rw5662589", "short_review": "Better than I thought would be", "full_review": "Started kinda boring , tried a few times to watch. It's worth to keep watching, first two seasons are great.", "review_date": "21 April 2020", "rating_value": "9"}, {"reviewer_name": "burakparlak", "reviewer_url": "/user/ur54912061/", "data-review-id": "rw4701394", "short_review": "Close to Epic", "full_review": "", "review_date": "6 March 2019", "rating_value": "9"}, {"reviewer_name": "t-dooley-69-386916", "reviewer_url": "/user/ur26401041/", "data-review-id": "rw3492122", "short_review": "Simply Brilliant True Life Depiction of the biggest Drug Lord Ever", "full_review": "", "review_date": "22 June 2016", "rating_value": "9"}, {"reviewer_name": "oystermann", "reviewer_url": "/user/ur57998389/", "data-review-id": "rw3315264", "short_review": "A French speaking JFK!", "full_review": "", "review_date": "11 September 2015", "rating_value": "7"}, {"reviewer_name": "channelnoise", "reviewer_url": "/user/ur59217228/", "data-review-id": "rw3308496", "short_review": "Absolutely gripping, realistic and fast paced", "full_review": "Fascinating, thrilling and powerful in all aspects. Brilliant acting performance by Wagner Moura playing Pablo Escobar. Boyd Holbrook as Steve Murphy is in a role of his life time. The background voice of Murphy, the scenic Columbia and the busy urban life makes it visually aesthetic as well. It is the best on Netflix at the moment. Netflix has once again lived up to to the expectation by bringing a show which is next to reality. Another good thing about \"NARCOS\" is the the fast pace it has to keep the audience engaged. Film lovers who like gangster movies will find this new series gripping. Folks looking out for some action paced crime drama should definitely hang on to this one. First episode will grab your attention to the level that you would want to see all ten episodes at once. Finally we got some gangster stuff to look at in classic settings.", "review_date": "31 August 2015", "rating_value": "9"}, {"reviewer_name": "villegasrest", "reviewer_url": "/user/ur46049708/", "data-review-id": "rw3308216", "short_review": "Worst casting", "full_review": "They should have used Colombian actors for this. Very bad accents in all principal actors. Also bad time line. the sequence is not good. The few Colombian actors appearing there do a very good job. The actor that plays Escobar forces too much all his dialogue, even to say bad words. That should be natural like in all the previous Colombian series about this same topic. This is the only one that makes Colombia see as a very weak country and that without foreign help would not have done anything against NARCOS. Some part of the story is not good, for example when M-19 releases Marta Nieves Ochoa. Lacks of research. Other topic is the subtitles, \"plata o plomo\" means you get money or you die, but not \"silver or lead\" like they posted. Thay should have hired someone from Colombia that knows all local expressions and again make someone to tell them naturally, not reading it with no sense", "review_date": "31 August 2015", "rating_value": "2"}]}, {"ImdbId": "tt2707408", "reviews": [{"reviewer_name": "Purukinho", "reviewer_url": "/user/ur61908275/", "data-review-id": "rw3307124", "short_review": "Amazing", "full_review": "It is undeniable that Wagner Moura is one of the big names in the current generation Brazil, and builds a far cry from Captain Nascimento Escobar made him internationally known (established in another partnership with director). In his hands, the dealer exposure are even more dangerous the former leader of BOPE, but much more relaxed and verified. Your greatest weakness are spaced in lack of knowledge about the Spanish, far from what would be expected of a Colombian cot. Even someone with little familiarity with the language, like this his speaks, can are bothered by the \"put\" and \"right\" inadvertently released the actor. \"The exhibition series in detail the clash between the forces conflict - legal, political, police, military and civilian - that ends in an effort to more powerful the commodity control world: a. cocaine \"While commanding 80% of world trade during cocaine the 1980s, Pablo Escobar figured in the magazine's list of billionaires \"Forbes\" in 1987. To this day, is considered the most Rico dealer of history. \"Narcos\" has the obvious quality of other products with the seal the content service on demand and are benefit of strong list headed by Moura, which also includes Pedro Pascal (\"Game of thrones \") and Juan Pablo Raba (\" Los caballeros las prefer raw \").", "review_date": "29 August 2015", "rating_value": "10"}, {"reviewer_name": "brdeveloper", "reviewer_url": "/user/ur27462099/", "data-review-id": "rw3307946", "short_review": "Don't review Narcos unless you watched the entire season", "full_review": "", "review_date": "30 August 2015", "rating_value": "9"}, {"reviewer_name": "rcrhea", "reviewer_url": "/user/ur42921372/", "data-review-id": "rw3487444", "short_review": "Could have been great, but they cast the wrong actor", "full_review": "", "review_date": "13 June 2016", "rating_value": "1"}, {"reviewer_name": "nyanbatcat", "reviewer_url": "/user/ur69975152/", "data-review-id": "rw4146316", "short_review": "Interesting story, boring storytelling", "full_review": "", "review_date": "28 April 2018", "rating_value": "5"}, {"reviewer_name": "nathanielsk", "reviewer_url": "/user/ur87695243/", "data-review-id": "rw4141501", "short_review": "The Same Episode Over and Over", "full_review": "Literally, every episode is the same thing as the last.", "review_date": "24 April 2018", "rating_value": "4"}, {"reviewer_name": "tpaladino", "reviewer_url": "/user/ur7854942/", "data-review-id": "rw3314759", "short_review": "Flawed but entertaining drama.", "full_review": "", "review_date": "11 September 2015", "rating_value": "7"}, {"reviewer_name": "jeevanjohnson", "reviewer_url": "/user/ur62636118/", "data-review-id": "rw3320725", "short_review": "Good start to screeching halt...", "full_review": "Dropped down from 9 star to 5 just because this started as a very good time line which suddenly comes to a screeching halt. Pablo Escobar is a real story which ended and should have ended in the season 1 too. And a new story be introduced in season 2. I have no patience to wait for the season 2 as the built up tempo fades away. I would want to see a story end victoriously in the war of drugs rather than drag the story line with additional, unwanted, irrelevant and many times false evidence. Once again, the season was a good start but would have been better if ended. There are always many stories in these genre which can be powerful and entertaining.", "review_date": "21 September 2015", "rating_value": "5"}, {"reviewer_name": "wykes-43834", "reviewer_url": "/user/ur80160791/", "data-review-id": "rw3799144", "short_review": "Great show to binge eat to.", "full_review": "", "review_date": "6 September 2017", "rating_value": "10"}, {"reviewer_name": "TheBigSick", "reviewer_url": "/user/ur60501911/", "data-review-id": "rw3796506", "short_review": "Season 3 is much better than the first two seasons", "full_review": "", "review_date": "3 September 2017", "rating_value": ""}, {"reviewer_name": "Siddhartha14", "reviewer_url": "/user/ur46761872/", "data-review-id": "rw5431150", "short_review": "What a snooze-fest", "full_review": "Wanted to like this since I like some of the actors but I just could stay engaged in this story. Unfortunately, just another in a long line of series that dramatize criminals and their backgrounds. Just too boring, seriously.", "review_date": "23 January 2020", "rating_value": "4"}, {"reviewer_name": "ruud_peeters1", "reviewer_url": "/user/ur28676944/", "data-review-id": "rw3309431", "short_review": "Netflix nails it. Again.", "full_review": "", "review_date": "2 September 2015", "rating_value": "10"}, {"reviewer_name": "sinan-tecer", "reviewer_url": "/user/ur19573571/", "data-review-id": "rw3575332", "short_review": "Finally I found something as fantastic as Breaking Bad", "full_review": "", "review_date": "5 November 2016", "rating_value": "10"}, {"reviewer_name": "jules1202000", "reviewer_url": "/user/ur6939286/", "data-review-id": "rw3311259", "short_review": "Disappointing !", "full_review": "If I hadn't watched previously \"Pablo Escobar, el patrón del mal\" maybe I would have enjoyed Narcos more.I can't help but the entire cast of the other one is beyond comparison.Starting with the main actor who portrays Pablo and the actress which plays his mother who was a major influence in his education and during his brief life.Pablo's mother in Narcos is merely ornamental. Also I don't like this major player they add to Narcos, the DEA American agent , it distracts the attention from the main plot. If you have time and patience ( 74 episodes ) watch the other one, if not go for Narcos aware that this is a shorter and more shallow version of a truly complex character named Pablo Escobar with many facets and a less interesting panel of Colombia history in the 80s.", "review_date": "5 September 2015", "rating_value": "5"}, {"reviewer_name": "sam-dijkstra", "reviewer_url": "/user/ur37362115/", "data-review-id": "rw3309453", "short_review": "You are not going to regret watching this", "full_review": "", "review_date": "2 September 2015", "rating_value": "10"}, {"reviewer_name": "qamanyyy", "reviewer_url": "/user/ur115883913/", "data-review-id": "rw5605311", "short_review": "Amazing", "full_review": "Amazing amazing\nAmazing amazing\nAmazing amazing ifjfjfjd\nChxjdhdjsnd\nDjdjshdj\nDidjsjsns", "review_date": "4 April 2020", "rating_value": "8"}, {"reviewer_name": "Anton-mans", "reviewer_url": "/user/ur51498185/", "data-review-id": "rw3806288", "short_review": "\"Blow\"n Away !!!", "full_review": "", "review_date": "15 September 2017", "rating_value": "9"}, {"reviewer_name": "ghostdrag35", "reviewer_url": "/user/ur57606962/", "data-review-id": "rw3307794", "short_review": "Netflix strikes gold again", "full_review": "great acting.. great story line.. very educational.. never a dull moment. action sequences were well done. really couldn't stop watching this show... very addictive. my only hangup was that most of the time.. you have to pay attention to subtitles instead of whats going on.. and sometimes i couldn't read fast enough. however it did add to its authenticity. pedro pascal once again holds his own as he did previously on game of thrones. the addition of the actual footage of what transpired back then was a nice touch.. as well as the narration. all and all one of the finer quality programs of 2015.. further solidifying Netflix as a powerhouse of original content.", "review_date": "29 August 2015", "rating_value": "8"}, {"reviewer_name": "MichaelALewis", "reviewer_url": "/user/ur54852139/", "data-review-id": "rw3307788", "short_review": "A promising series", "full_review": "", "review_date": "28 August 2015", "rating_value": "10"}, {"reviewer_name": "thelightsareoff", "reviewer_url": "/user/ur51239751/", "data-review-id": "rw3309150", "short_review": "Fantastic", "full_review": "Stunning performances, chilling reality. An new benchmark in television. Netflix, you scored. Wagner's acting sets new standards. I watched all 10 episodes in a 2-day marathon, this is television at its best. You don't know if you hate or love Escobar, the series puts you on a different side at any moment. After episode 3 you are hooked. A few inconsistencies to notice; a late model BMW of a different era, lightweight body-armor. But that is detail to a series where character building in historic context is done at its best. Superp co-acting. If you thought Narco is bad, reset. It is VERY bad and you will see. A great way to quickly get the history of Colombia and its struggle in the last 30 years.", "review_date": "1 September 2015", "rating_value": "9"}, {"reviewer_name": "spanishlatam", "reviewer_url": "/user/ur40732610/", "data-review-id": "rw5978416", "short_review": "The Narrator ruin the show", "full_review": "I thought that Narration would end in episode 1 so I was happy to watch the next episode until... yes, same boring Narration. I quit.", "review_date": "9 August 2020", "rating_value": "5"}, {"reviewer_name": "mabilokojeime", "reviewer_url": "/user/ur82230911/", "data-review-id": "rw4433711", "short_review": "US interventionism", "full_review": "", "review_date": "2 November 2018", "rating_value": "5"}, {"reviewer_name": "bola_de_pu", "reviewer_url": "/user/ur30155746/", "data-review-id": "rw3796104", "short_review": "Better than ever.", "full_review": "OK, I need to write these review because I see a lot of people complaining about \"No More Escobar\", hell what you expect? These show is based on Narcos = Drug Kingpins; and the course that take the drug when the most powerful drug kingpin on the world bite the dust for the first time in his life. \"I miss Escobar\", \"The show isn't the same without Escobar\", \"Cali Cartel is boring\"; I guess these people never hear of character development and the assumption that the drug kingpins don't have the same methods, because they evolve and learn from the mistakes of their opponents. I see other people saying that these show is the same as the others narcos shows like: El Cartel De Los Sapos, El Patrón Del Mal, Bloque De Búsqueda, Alias JJ, El Señor De Los Cielos and the list goes on and goes on. Wrong, AGAIN. The quality of the music in these show, the actors used to represent all the characters (especially the role of Jorge Salcedo personified by Martín Varela was the best of the 3 Narcos seasons so far, even better than the recognized Pedro Pascal as Peña, Wagner Moura as Pablo Escobar and Damián Alcázar as Gilberto Rodríguez) and the beauty of the setting make these show the best TV show in history when the 95% of the actors speak in the Spanish language.And I feel very proud of that as puertorican, because a lot of the music used in the show by the genre of \"Salsa\" comes from my island like: Héctor Lavoe, Ismael Rivera, Cheo Feliciano, Angel Canales and the list goes and goes on and bring an unique caribbean flavor to the show. Of course, I'm not proud of the actions committed by all those narcos, but it's important to know the history of our brother country, Colombia. My only complaint is some of the actor accents, but what the ****, if you want quality actors you need to let that triviality pass. Hell, I expect that the next season will be based in the ruthless empire of Orlando Henao Montoya and the Cartel del Norte Del Valle and I assume by the popularity of these show the producers will continue these show with the mexicans drug kingpins that rise after the destruction of Cali Cartel, Medellín Cartel and Norte Del Valle Cartel. Can't wait for season 4!!!", "review_date": "2 September 2017", "rating_value": "10"}, {"reviewer_name": "Lady_Targaryen", "reviewer_url": "/user/ur6643268/", "data-review-id": "rw3588896", "short_review": "Awesome show, great performance, highly addictive!", "full_review": "", "review_date": "29 November 2016", "rating_value": "9"}, {"reviewer_name": "mahiz_email", "reviewer_url": "/user/ur11928730/", "data-review-id": "rw3311286", "short_review": "If you loved The Wire, The Shield or SOA, WATCH THIS! BRAVO Wagner Moura, what a brilliant performance.", "full_review": "", "review_date": "5 September 2015", "rating_value": "9"}, {"reviewer_name": "bogota909", "reviewer_url": "/user/ur37588642/", "data-review-id": "rw3308725", "short_review": "Best series period!!! I seen all season 1 yesterday I was hooked.", "full_review": "the best portrayal of the real Medellin cartel, bar none\" I'm Colombian and have done research intensely on Colombian cartels then and now.. Love the authenticated this is better then blow,yes people i said blow!!! love the real dialogue, for the most part using real Colombian actors overall 9/10 Heres what i would critiqued The dull acting from the portrayal of American dea agents, and the wife is a horrible actress, give the man credit that played escobar did a great job needed to work on his accent overall good 7.5/10 his portrayal, they also needed to talk about key figures of the medellin cartel including transporters mickey Monday's, john Robert's, George Jung and especially Griselda blanco and Fabio Ochoa.. Hope in season 2 they are shown!!", "review_date": "31 August 2015", "rating_value": "10"}]}, {"ImdbId": "tt2707408", "reviews": [{"reviewer_name": "Victor-15", "reviewer_url": "/user/ur0096286/", "data-review-id": "rw3308201", "short_review": "Espetacular", "full_review": "Excellent production with an amazing result. It seems a symbiosis with POLICE SQUAD, CITY OF GOD and SCARFACE. The critics about Wagner's accent are legit. The diving in Colombia's culture, the producer's brave act in presenting the show with majority Spanish lines deserved a real Colombian actor. However, if the Wagner's performance is mediocre (or very little higher than that) and his accent is bad, everything else pays off the work. The cinematography, the editing, the soundtrack, the script, the narrative technique, the application of real and historical photos and videos, all of this is great! I'm looking forward for the next season.", "review_date": "31 August 2015", "rating_value": "10"}, {"reviewer_name": "doctj22", "reviewer_url": "/user/ur28546903/", "data-review-id": "rw3307936", "short_review": "Lord of War version of Pablo Escobar", "full_review": "", "review_date": "30 August 2015", "rating_value": "7"}, {"reviewer_name": "raffydibansa", "reviewer_url": "/user/ur127962384/", "data-review-id": "rw6446008", "short_review": "Season 1 was good. Season 2 tries to figure itself out.", "full_review": "Season 1 had a strong opening, acting and music were great. Story and pacing consumes you into the criminal world and shows you the consequences through the eyes of the cops. Season 2, however, was all over the place. It had narration when it didn't really need narration. Showed too much of the politics and didn't really pack in the punch in the gut that season 1 had when characters meet their fates.", "review_date": "5 January 2021", "rating_value": "6"}, {"reviewer_name": "YourBossHere-00", "reviewer_url": "/user/ur86034080/", "data-review-id": "rw5838920", "short_review": "Absolute Gem from Netflix.", "full_review": "", "review_date": "20 June 2020", "rating_value": "10"}, {"reviewer_name": "nilldas", "reviewer_url": "/user/ur94823675/", "data-review-id": "rw5756229", "short_review": "Made me mad !", "full_review": "This is one of the best series i have watched, , But after death of Publo there's nothing much to see about. Lost interest. And the season 3 was serious waste of mood and time . Loved the class of that series ❤", "review_date": "20 May 2020", "rating_value": "8"}, {"reviewer_name": "nitinkatiyar-katiyar555", "reviewer_url": "/user/ur41225435/", "data-review-id": "rw5748600", "short_review": "For colombia police", "full_review": "Such a excellent web series. Pablo killed because of support of Columbia police to los pepes but both are same in business, killing innocent people. Why colombia police making slogan \" long live colombia\" when los pepes group were alive. its not good sound for all colombia beacause of their support Los pepes they will be next pablo 😂, so this is not winning for Colombia. When Colombia police want to kill los pepes then he will take suport of another bandit 😂, this will work like as series.", "review_date": "18 May 2020", "rating_value": "9"}, {"reviewer_name": "nneelakandan", "reviewer_url": "/user/ur34159362/", "data-review-id": "rw5679040", "short_review": "Don't miss it", "full_review": "One of the best show in Netflix. Season 1&2 was best season 3 was okay.", "review_date": "26 April 2020", "rating_value": "8"}, {"reviewer_name": "seconomon", "reviewer_url": "/user/ur116733197/", "data-review-id": "rw5644763", "short_review": "Addictive", "full_review": "I am hooked. Such a well done show. My only complaint... the subtitles flash off way to fast and the white lettering makes it hard to read on different backgrounds. Be ready to hit pause and rewind a lot if you are not fluent in both English and Spanish. It is absolutely worth it though.", "review_date": "16 April 2020", "rating_value": "8"}, {"reviewer_name": "fredericercole", "reviewer_url": "/user/ur60561059/", "data-review-id": "rw5543802", "short_review": "How law kills", "full_review": "", "review_date": "11 March 2020", "rating_value": "10"}, {"reviewer_name": "parulsharmma-49497", "reviewer_url": "/user/ur113000588/", "data-review-id": "rw5530330", "short_review": "amazing story of pablo escobar", "full_review": "Narcos is really mesmerizing performance. it is a true story of notorious drug dealer and trafficker. I think pablo escobar is cruel, bad person he sent his people to kill anybody who stop him. he elected in politics and won the election. he could buy more powerful people to follow his rule but not all people he could buy. there are some people like minister ,DEA or police who still believe that there is future for their country by shutting down person like pablo escobar. narcos dealing was not good and clean, lots of people died even they are narcos dealer or other people. but if we see another side pablo is a very romantic husband and good to his mother. so there is mixing of feelings he wants to be the wealthiest person in the world every men has dream of but the path he chose is completely wrong", "review_date": "6 March 2020", "rating_value": "9"}, {"reviewer_name": "khazragui-91746", "reviewer_url": "/user/ur71727082/", "data-review-id": "rw5374274", "short_review": "Worth it", "full_review": "My only issue with the movie was that it was mostly in Spanish where I had to be staring at the screen translation all the time not able to multitask. Other than that I liked it", "review_date": "2 January 2020", "rating_value": "8"}, {"reviewer_name": "TwittingOnTrender", "reviewer_url": "/user/ur32263666/", "data-review-id": "rw4960517", "short_review": "Highly Addictive", "full_review": "Amazing, riveting stuff, proving fact can be more horrifying than fiction. Superb performances by all concerned - all of the female characters (except perhaps Messina, who was a little weak) leap off the screen, proving that talent will out and you don't have to trumpet an all female remake of Ghostbusters, Dirty Rotten Scoundrels or whatever to provide meaty, substantial roles for women.\nIt's all been said by other reviewers - it was heading for a ten, but I had to knock a couple of points off for the padding in the last couple of episodes, while we waited for the inevitable", "review_date": "26 June 2019", "rating_value": "8"}, {"reviewer_name": "ethanvazquez", "reviewer_url": "/user/ur79510807/", "data-review-id": "rw4909037", "short_review": "Plata o Plomo?", "full_review": "This brilliantly acted series is the best show on Netflix. Each season surpassing the previous with its own convictions. I feared the show would decline with the absence of Pablo Escobar(a sublime Wagner Moura) but the opposite was true. I can't wait for Narcos USA.", "review_date": "3 June 2019", "rating_value": "10"}, {"reviewer_name": "paul2001sw-1", "reviewer_url": "/user/ur2082018/", "data-review-id": "rw4485874", "short_review": "America vs. evil", "full_review": "'Narcos' tells the extraordinary story of Pablo Escobar, a Columbian who rose to the top of a massive drug smuggling enterprise. The series has been highly praised, but I didn't like it that much. Told from the perspective of U.S. government agents, it paints a picture where those agents are tough as hell but essentially heroic, and there's relatively little interest in the everyday lives of ordinary Columbians (or indeed, of Americans addicted to the drugs Escobar smuggled). Whereas series like 'The Wire' have shown us drug barons who, while grotesque, remain human, 'Narcos' is more about spectacle, and a story whose morality is fundamentally black and white. The details of Escobar's tale are amazing; but I didn't feel I got much in the way of deep insight by watching this show.", "review_date": "29 November 2018", "rating_value": "6"}, {"reviewer_name": "gevmart", "reviewer_url": "/user/ur60334069/", "data-review-id": "rw3794038", "short_review": "Fantastic show, among the best now on air", "full_review": "", "review_date": "31 August 2017", "rating_value": "9"}, {"reviewer_name": "eugene-alexander", "reviewer_url": "/user/ur20277622/", "data-review-id": "rw3788845", "short_review": "Excellent Excellent Excellent!!!!!!", "full_review": "I was anxious to see this new Netflix series and had great expectations. They did it again. I cannot stop watching. One episode after another. Okay if the cast is not Colombian, but they are all very good actors and play the parts very well. I finished all the episodes and can't wait for Season 3. Best series of the year so far. The action is great. The scenarios are perfect. The 1980's atmosphere is awesome. 10 out 0f 10. I hope they will make more series like that in the future. Good real stories and perfect action and direction. They did a great job!", "review_date": "25 August 2017", "rating_value": "10"}, {"reviewer_name": "mreviewer82", "reviewer_url": "/user/ur56588638/", "data-review-id": "rw3572507", "short_review": "Daring, gritty, authentic", "full_review": "Spectacular show with phenomenal performances. Wagner Moura is a revelation as Escobar, making him charismatic, enigmatic, repulsive, murderous, monstrous, and sympathetic all at once. Each show has the look, feel, and edge of a feature-level film, and best of all it doesn't cop out by making it all English language. Rather, it's a mostly Spanish language series with English narration. This is by far the most engaging, memorable, and insightful look into Escobar's life and persona, and it also creates vivid, well-developed supporting characters in its supporting case (namely detective Pena stands out). Overall, \"Narcos\" is brilliantly directed, expertly acted, and efficiently produced.", "review_date": "31 October 2016", "rating_value": "10"}, {"reviewer_name": "prabhavpradeep", "reviewer_url": "/user/ur126929092/", "data-review-id": "rw6850737", "short_review": "Netflix Nailed It", "full_review": "What a show !! Worth watching once in a lifetime wonderfull , excellent work by actors and everyone. Everything in this show is on to the point of fact expect few. You will fell in love with Escobar and cocaine..", "review_date": "25 April 2021", "rating_value": "10"}, {"reviewer_name": "dheerajmakode", "reviewer_url": "/user/ur129562689/", "data-review-id": "rw6813498", "short_review": "The Best Gangster Series I found with Real Touch", "full_review": "", "review_date": "14 April 2021", "rating_value": "9"}, {"reviewer_name": "damik-51864", "reviewer_url": "/user/ur113929572/", "data-review-id": "rw6811081", "short_review": "\"Plata o Plomo\" 8,5/10", "full_review": "", "review_date": "13 April 2021", "rating_value": "8"}, {"reviewer_name": "stilonkostrzyn", "reviewer_url": "/user/ur130713295/", "data-review-id": "rw6804613", "short_review": "Good overall", "full_review": "Well, the \"escobar saga\" is top notch but after el patrons death......i dont know, maybe its just me but i couldnt get into season 3, they shouldve stopped after season 2.", "review_date": "11 April 2021", "rating_value": "8"}, {"reviewer_name": "ACollegeStudent", "reviewer_url": "/user/ur118665987/", "data-review-id": "rw6770681", "short_review": "A Consistently Good Crime Drama with a Few Great Episodes", "full_review": "", "review_date": "2 April 2021", "rating_value": "7"}, {"reviewer_name": "sponja-14657", "reviewer_url": "/user/ur74777214/", "data-review-id": "rw6757352", "short_review": "Bigger", "full_review": "One of the bigger series of history. Actors are made for this caracters.", "review_date": "29 March 2021", "rating_value": "9"}, {"reviewer_name": "fourhfour", "reviewer_url": "/user/ur77836851/", "data-review-id": "rw6748335", "short_review": "Watch for the Pablo Escobar Story", "full_review": "I loved the first two seasons. I didn't really care for season 3. The show should've ended with Escobars death.", "review_date": "27 March 2021", "rating_value": "8"}, {"reviewer_name": "ryanalexisshen", "reviewer_url": "/user/ur122096367/", "data-review-id": "rw6730386", "short_review": "A masterpiece", "full_review": "This time, Netflix has done it right with this masterpiece.", "review_date": "22 March 2021", "rating_value": "10"}]}, {"ImdbId": "tt2707408", "reviews": [{"reviewer_name": "Mannequin", "reviewer_url": "/user/ur2136437/", "data-review-id": "rw6719289", "short_review": "First Season 9/10 - Second 2/10 - Third Skipped", "full_review": "", "review_date": "20 March 2021", "rating_value": "5"}, {"reviewer_name": "joemcfadden-60566", "reviewer_url": "/user/ur103156501/", "data-review-id": "rw6699495", "short_review": "One of the best shows on Netflix", "full_review": "I'm someone who very much enjoys a well made gritty crime drama with complex characters that are compelling and a story that's both interesting and engaging. Narcos gave me everything I could have wanted from a tv show and more! While many people don't seem to like the character of Steve murphy, and I admittedly didn't think he was as likeable as javier peña, I thought he was a very effective showcase for what being in that country, in that time, in that line of work would do to a man. Javier peña is just a terrific character and pablo Escobars character arc was extremely well thought through and executed.\nThere are a lot of characters that are very well performed by terrific actors and help show the grey morality of the people involved in these real life events, even though you like a lot of the characters you find yourself questioning whether what they're doing is worth it or not, but you completely understand that they can't just turn back.\nAn aspect that I haven't heard that many people mention is just how amazing the music for the show is. The opening theme gets a lot of well deserved praise, but the score music is so amazing and really brings you into the characters mindsets aswell as pumping adrenaline through your veins.", "review_date": "16 March 2021", "rating_value": "10"}, {"reviewer_name": "jakubkusnierz", "reviewer_url": "/user/ur128741939/", "data-review-id": "rw6696122", "short_review": "This series is amazing", "full_review": "This series is amazing ! I watched it three times, I love series that talks about drug trafficking and cartels. narcos is a really interesting and captivating series which retrace the life of Pablo Escobar and Medellín cartel in the season 1 then in season 2 and 3 came the Cali cartel and cartel war between them two. I recommend you this series.", "review_date": "15 March 2021", "rating_value": "9"}, {"reviewer_name": "daves_dogg", "reviewer_url": "/user/ur128553522/", "data-review-id": "rw6695223", "short_review": "Great except the subtitles.", "full_review": "I really liked the story, and the acting. I remember some of the things that happened in it, from when I was young.\nNow I moved to Narcos Mexico. It seems like this one.", "review_date": "15 March 2021", "rating_value": "10"}, {"reviewer_name": "rjwfbft", "reviewer_url": "/user/ur130282938/", "data-review-id": "rw6683003", "short_review": "So good you can't stop watching", "full_review": "Amazing show and might rewatch it. Love the story. The actors. Everything", "review_date": "11 March 2021", "rating_value": "9"}, {"reviewer_name": "vallavan_8", "reviewer_url": "/user/ur29016106/", "data-review-id": "rw6679473", "short_review": "Master piece", "full_review": "Only this show that I watched many times and still not tired of it. It got me hooked so much. I like it more then GOT", "review_date": "10 March 2021", "rating_value": "10"}, {"reviewer_name": "dwp1948", "reviewer_url": "/user/ur99310909/", "data-review-id": "rw6674132", "short_review": "An Excellent Series That Will Hold Viewers Interest To The End - Believable Actor/Actresses", "full_review": "03/08/2021 This is an excellent series that constantly holds the viewers interest throughout all three seasons. I started season three yesterday and couldn't stop watching until all ten episodes were finished. Season three ramps up the violence so don't pass it by. Watch for yourself and decide? I wish all series were this well done. Bon Appetit'", "review_date": "8 March 2021", "rating_value": "10"}, {"reviewer_name": "hgtyf-15098", "reviewer_url": "/user/ur129999564/", "data-review-id": "rw6661187", "short_review": "10/10", "full_review": "Mythic series 10/10 An imaginary series and for myself I see the series as the best 8 series for me", "review_date": "5 March 2021", "rating_value": "10"}, {"reviewer_name": "abdullahmofareh", "reviewer_url": "/user/ur71473272/", "data-review-id": "rw6651349", "short_review": "The first two seasons are awesome", "full_review": "The third season is very weak compared to the first and second.", "review_date": "1 March 2021", "rating_value": "8"}, {"reviewer_name": "nrgbhardwaj", "reviewer_url": "/user/ur126099862/", "data-review-id": "rw6579268", "short_review": "An artistic masterpiece to show the deep story of pablo escobar .", "full_review": "Acting - worldclass\nmusic - classy and beautifull\neducation - deep\napproach - artistic\nlovers of this show - connoisseur like us .", "review_date": "9 February 2021", "rating_value": "9"}, {"reviewer_name": "said_kurollo", "reviewer_url": "/user/ur124871671/", "data-review-id": "rw6512104", "short_review": "Amazing adaptation 👌", "full_review": "Netflix did a great job in this show. i liked it too much. Its Dark and realistic.", "review_date": "22 January 2021", "rating_value": "8"}, {"reviewer_name": "karn-13156", "reviewer_url": "/user/ur123732309/", "data-review-id": "rw6463556", "short_review": "BEST SHOW OF ALL TIME!", "full_review": "Best show of ALL TIME, I've never watched any other show from beginning to end 10+ times. Every other show is garbage!", "review_date": "11 January 2021", "rating_value": "10"}, {"reviewer_name": "DanialAbufarha", "reviewer_url": "/user/ur94178919/", "data-review-id": "rw4482018", "short_review": "Good TV show, but..", "full_review": "Apart from the audacious humanization of murderers and criminals such as Pablo Escobar, his crew, and Los Pepes, I think the first two seasons are impressive. And what great acting by Wagner Moura. Unbelievably talented.", "review_date": "27 November 2018", "rating_value": "7"}, {"reviewer_name": "blomqviste", "reviewer_url": "/user/ur38124608/", "data-review-id": "rw3309302", "short_review": "The real true detective season 2 we deserve. (kinda)", "full_review": "", "review_date": "1 September 2015", "rating_value": "9"}, {"reviewer_name": "guganorio", "reviewer_url": "/user/ur62414484/", "data-review-id": "rw3308929", "short_review": "Bravo!!!", "full_review": "", "review_date": "1 September 2015", "rating_value": "10"}, {"reviewer_name": "caiobonilha", "reviewer_url": "/user/ur62260342/", "data-review-id": "rw3839230", "short_review": "A big mistake", "full_review": "Production is making two capital errors: (i) treat Escobar as a family man. An evil man that do not hesitate to explode a commercial plane (among other crimes) is all but a family man; (ii) Brazilian actor as Escobar is laughable. His Colombian accent is a joke: a mix of Portuguese with Spanish. Maybe he should take better Spanish lessons.", "review_date": "23 October 2017", "rating_value": "3"}, {"reviewer_name": "marcellino-912-12601", "reviewer_url": "/user/ur24391683/", "data-review-id": "rw3539712", "short_review": "Sublime acting and storyline", "full_review": "", "review_date": "7 September 2016", "rating_value": "10"}, {"reviewer_name": "phd_travel", "reviewer_url": "/user/ur22484170/", "data-review-id": "rw3320206", "short_review": "A must watch - fact is stranger than fiction", "full_review": "", "review_date": "20 September 2015", "rating_value": "10"}, {"reviewer_name": "AudioFileZ", "reviewer_url": "/user/ur3580907/", "data-review-id": "rw3312705", "short_review": "Third Season Is As Great As Previous Two", "full_review": "", "review_date": "8 September 2015", "rating_value": "10"}, {"reviewer_name": "eric-shoe", "reviewer_url": "/user/ur25838104/", "data-review-id": "rw3312090", "short_review": "Terrific", "full_review": "I usually don't write reviews but I felt an obligation to urge you to watch this tremendous production. It is truly a powerful experience worthy of your time. I watched it over the course of 2 days. Like House of Cards, I'll watch it again before Season 2. It is in the same league as The Sopranos in many ways. Tony and Pablo - similar egos but Pablo was a real person and made billions. As in the Sopranos, viewers see both sides of the criminal vs. the law conflict, with no hints of what happens next. The cinematography is excellent which allows viewers to experience the beauty of Colombia even as death and destruction fills the country with fear. The violence factor is a 10 but the story couldn't be told without it. I strongly recommend \"Narcos\" as a new Netflix epic.", "review_date": "6 September 2015", "rating_value": "10"}, {"reviewer_name": "videofreak-45348", "reviewer_url": "/user/ur62501334/", "data-review-id": "rw3311650", "short_review": "What a show!", "full_review": "", "review_date": "6 September 2015", "rating_value": "9"}, {"reviewer_name": "jorgeguzman-84128", "reviewer_url": "/user/ur62390384/", "data-review-id": "rw3308110", "short_review": "Great show", "full_review": "Netflix has yet another fantastic show with Narcos.Overall the cast play their roles amazingly and the subject matter is as entertaining as it is dark. The story of Pablo Escobar is told well and the depiction of Columbia and Pablo feel very authentic. My minor complaint would be that Wagner Moura's Spanish accent stands out a little against some of his fellow actors, its not a big problem and probably only really noticeable if your'e fluent in Spanish. Everything else about the show is done very well and the production value is great! Narcos is a fantastic mafia/cop show that adds even more value to your Netflix subscription. I hope that shows of this quality will continue to be a trend on Netflix.", "review_date": "31 August 2015", "rating_value": "9"}, {"reviewer_name": "tropicalsunsations3", "reviewer_url": "/user/ur46388695/", "data-review-id": "rw3307791", "short_review": "Great Start", "full_review": "", "review_date": "28 August 2015", "rating_value": "9"}, {"reviewer_name": "prvanjules", "reviewer_url": "/user/ur35138385/", "data-review-id": "rw3307027", "short_review": "Cats and drugs", "full_review": "", "review_date": "29 August 2015", "rating_value": "8"}, {"reviewer_name": "chrisjijon", "reviewer_url": "/user/ur83434606/", "data-review-id": "rw5896185", "short_review": "Couldn't you find people who speak the language?", "full_review": "I couldn't watch more than two episodes.. Listening to Escobar speak whatever language that was... If you don't speak Spanish you won't notice it but for the rest...", "review_date": "10 July 2020", "rating_value": "4"}]}, {"ImdbId": "tt2707408", "reviews": [{"reviewer_name": "kulinkoolkkp", "reviewer_url": "/user/ur67769602/", "data-review-id": "rw4410668", "short_review": "It's simply is lit 🔥", "full_review": "This is one of the best tv shows, like seriously it just can't get better then this! A must watch for everyone the acting,story,screenplay,everything is just best.\nMy personal favourite is season 3 I know you won't believe it but it's even better then the first 2 😎🙌", "review_date": "21 October 2018", "rating_value": "10"}, {"reviewer_name": "Thrashman88", "reviewer_url": "/user/ur0121300/", "data-review-id": "rw3822616", "short_review": "Season 3: Real Life Drama Hits Too Close To Home", "full_review": "", "review_date": "4 October 2017", "rating_value": "9"}, {"reviewer_name": "Micknay", "reviewer_url": "/user/ur80823623/", "data-review-id": "rw3817070", "short_review": "Drug Trafficking in Columbia", "full_review": "Very Addicting show, Love the action and suspense I can look forward to when sitting back on Netflix and putting Narcos on. Just finished season 3 in a breeze and was kept very interested in the Cali Cartel and how they were taken down. Season 1 & 2 about Pablo definitely blew season 3 out of the water, but I'm crossing my fingers Narcos comes back for a season 4 in Mexico despite what happened with their casting director. One of my top 5 favorite shows in a list including Breaking Bad, Black Mirror, Weeds, and Entourage.", "review_date": "28 September 2017", "rating_value": "10"}, {"reviewer_name": "tlrg-legend", "reviewer_url": "/user/ur35376689/", "data-review-id": "rw3799939", "short_review": "Great 10/10 Excellent Excellent", "full_review": "", "review_date": "7 September 2017", "rating_value": "10"}, {"reviewer_name": "justin-fencsak", "reviewer_url": "/user/ur18723110/", "data-review-id": "rw3639461", "short_review": "One of the best Netflix series of all time.", "full_review": "Not since House of Cards has there been a show so captivating it must be binged to be experienced with. Such as the case with Narcos, which is subtitle heavy since most of the characters speak Colombian. It takes some time to pay attention. Like every Netflix show, there is a considerable amount of sex, violence, language, and nudity that is not appropriate for kids. I'm almost done with season one on Blu-Ray and can't wait to see what's next in season 2, which is now streaming on Netflix. Most of the cast is unknown but the blonde chick in that show is really hot. The locations are really great and they use archival news footage from the era to set the mood for the saga.", "review_date": "13 February 2017", "rating_value": "9"}, {"reviewer_name": "varun-mentor", "reviewer_url": "/user/ur21193872/", "data-review-id": "rw3539443", "short_review": "Scarface reinvented in Pablo Escobar", "full_review": "", "review_date": "7 September 2016", "rating_value": "10"}, {"reviewer_name": "normanjimenez", "reviewer_url": "/user/ur62358896/", "data-review-id": "rw3307112", "short_review": "It's good", "full_review": "", "review_date": "29 August 2015", "rating_value": "7"}, {"reviewer_name": "papo-64350", "reviewer_url": "/user/ur63523033/", "data-review-id": "rw3531031", "short_review": "casting", "full_review": "I cannot believe they chose a Brazilian to play Pablo Escobar, nothing against the Brazilians or their actors, but you are talking about a person from Medellin, Colombia and they speak way different than other Colombians. We have great Colombian actors that could have played Pablo better and with the Paisa Accent like the real Pablo. Please producers, directors and everyone involved in making films and movies and series, use actors from the country you are making a movie about. It's like using a white guy to play a black guy. Really!!!!! This tells me that you are probably new to this field and have no idea how important it is to get the best actors for your film. I love Brazil and the people from there and nothing against them for acting or whatever, it's just that you have to be realistic and try and make the movie the most realistic one so that we the audience can identified and understand the true events that occur. Thank you,", "review_date": "23 August 2016", "rating_value": "1"}, {"reviewer_name": "jaimeherrera-22644", "reviewer_url": "/user/ur62376798/", "data-review-id": "rw3307691", "short_review": "How poor production from every point of view", "full_review": "The most unpleasant thing is that the main character of the series is not Colombian, not fluent in Spanish, much less can even come close to what the accent of Colombia, or specifically of Medellin. A poor presentation begins. Notably, another people have already made several productions to express the theme here highlights, however these earlier productions are truly extraordinary, which is increasingly opaque this poor production. Worth putting this out, because other characters in the series, are Colombian and represent their roles very well. But what a problem, not the protagonist. Moreover no fundamental issues of this story as it is the original culture of the facts either expressed. You can not import a different culture because it changes the basic facts. Not express the culture and so give little importance to elements that actually are important is a lost and becomes, or would become a production expressing either a subject that is not linked to actual facts. And yet that's where the series worse it gets, because it is not capable of expressing a script with an original and captivating drama. The participation of third-person narration might have been good but the truth is that the opportunity to take advantage was lost. Anyway. VERY BAD", "review_date": "30 August 2015", "rating_value": "1"}, {"reviewer_name": "jorruuscabaoth69", "reviewer_url": "/user/ur45092385/", "data-review-id": "rw4277267", "short_review": "SEASON 4?!", "full_review": "Where is Season 4? What happened? Has it been cancelled? Its no longer in the list.", "review_date": "10 August 2018", "rating_value": "9"}, {"reviewer_name": "jimmycoffin-751-212853", "reviewer_url": "/user/ur45461313/", "data-review-id": "rw4691483", "short_review": "Worst crap Ive ever seen.", "full_review": "The Dea's wife explains hos stupid this show\nIs in The beginning of season 2.\n-I want to get out of this place, I want us to be safe. Hahaha Why the Freakin F did she follow the husband to colombia then?? The Biggest drug warzone in the world at that time?? Then to the next question. What kinda wife follows her husband to such a place. Wasnt the deadly streets of L.A dangerous enough? She surely couldnt be that NAIVE? Not knowing what her husbands job was???! To live right in the crack cocain cloud of trigger happy psychopaths.\nThis is what the show Is between the usual cops and robbers action. A line from some unlikable character in the show. Makes it hyper real how bad the script is.\nBad writing throughout. Plot holes. Lots of made up Fantasy and fillers.", "review_date": "28 February 2019", "rating_value": "1"}, {"reviewer_name": "Silversea0072002", "reviewer_url": "/user/ur7185457/", "data-review-id": "rw3795081", "short_review": "Bloque de Busqueda and Blow all over again ?", "full_review": "", "review_date": "1 September 2017", "rating_value": "1"}, {"reviewer_name": "swilliky", "reviewer_url": "/user/ur49074014/", "data-review-id": "rw3541474", "short_review": "An amazing streaming original about important history", "full_review": "", "review_date": "10 September 2016", "rating_value": "8"}, {"reviewer_name": "tuomo_karvonen", "reviewer_url": "/user/ur24462403/", "data-review-id": "rw3359454", "short_review": "Well produced and entertaining but slightly disappointing", "full_review": "", "review_date": "22 November 2015", "rating_value": "7"}, {"reviewer_name": "kotapatiswaraj", "reviewer_url": "/user/ur116877885/", "data-review-id": "rw5873196", "short_review": "IMPRESSIVE", "full_review": "", "review_date": "1 July 2020", "rating_value": "9"}, {"reviewer_name": "ospage", "reviewer_url": "/user/ur71163998/", "data-review-id": "rw5706093", "short_review": "Too much fiction", "full_review": "I would give it a higher rating, if it wasn't for all the unnecessary fabrications. It is known that the serial was criticized by living persons, who were involved in the depicted events, and a quick search on Google will show you that the creators approached the topic very deliberately. They even went so far that they made up certain persons, such as \"David Rodriguez\", a psychopatic son of Miguel Rodriguez that has never existed. And the depiction of the murder of Valeria Vélez, who is very alive in the United States, was simply too much...", "review_date": "4 May 2020", "rating_value": "7"}, {"reviewer_name": "khries", "reviewer_url": "/user/ur109694033/", "data-review-id": "rw5350263", "short_review": "Review", "full_review": "No point of watching it after season 2 after season 2 since the driving force behind the series is dead there is no point watching it further", "review_date": "24 December 2019", "rating_value": "10"}, {"reviewer_name": "harshalagrawal03", "reviewer_url": "/user/ur21352722/", "data-review-id": "rw3805468", "short_review": "It shows you how to play the system, piece by piece", "full_review": "", "review_date": "14 September 2017", "rating_value": "10"}, {"reviewer_name": "epiphanes", "reviewer_url": "/user/ur5317730/", "data-review-id": "rw3612540", "short_review": "Good work", "full_review": "These series, at least the first two seasons are very well made. Wagner Moura is perfect actor, multilingual and unpredictable. I saw him in Tropa de Elite 1 and 2 where he had done a great acting job. Here is also the same case. Two DEA agents are well made characters - Latino one is passionate and quick to act, while the American one is stubborn and proud. The only minor flaw is the speed of major events, or should I say typical flaw while making historical movies or biographies. You don't have a sense how much time has past. The first season covers 15 years of history - from Pablo's first mugshot in 1977 until his escape from La Catedral in 1992. The second season is based around his evasion of police forces and Los Pepes during the 1992 and 1993. Second season is more about the family where you can see what was Pablo capable of doing to secure his family and what errors he made just to be in contact with them. All in all these series are very good, watchable, with some historical inaccuracies which are probably intended as it is shown on the show's disclaimer.", "review_date": "4 January 2017", "rating_value": "9"}, {"reviewer_name": "tankace", "reviewer_url": "/user/ur63469855/", "data-review-id": "rw3561483", "short_review": "Addictive and accurate, but not boring!", "full_review": "", "review_date": "14 October 2016", "rating_value": "9"}, {"reviewer_name": "bandidoportista", "reviewer_url": "/user/ur62422871/", "data-review-id": "rw3537918", "short_review": "Amazing TV Show (SPOILER)", "full_review": "", "review_date": "4 September 2016", "rating_value": "10"}, {"reviewer_name": "cosmicfoxie", "reviewer_url": "/user/ur68467827/", "data-review-id": "rw3535796", "short_review": "Great Show", "full_review": "I'm really enjoying this well done Netflix series and quite amazing story about the advent of (prolific) Cocaine, colourful Columbia, the reality of Politics and International ($) Policy, the DEA, and Money... so much money! All centered around the contrary family man Pablo. Fast paced, well directed and acted plus good humoured despite the gravity. I can't speak Spanish so I'm not bothered by language technicalities or accents. Love quirky inclusions to explain context of story such as 'the cat'. Bring me some more magic please; \"Magical realism is defined as what happens when a highly detailed, realistic setting is invaded by something too strange to believe. There is a reason magical realism was born in Colombia\"", "review_date": "31 August 2016", "rating_value": "9"}, {"reviewer_name": "alaaaldinnawi", "reviewer_url": "/user/ur63776195/", "data-review-id": "rw3354540", "short_review": "Great, you want regret !!!!", "full_review": "", "review_date": "14 November 2015", "rating_value": "9"}, {"reviewer_name": "deloudelouvain", "reviewer_url": "/user/ur58525162/", "data-review-id": "rw3323199", "short_review": "Wow what a great show!", "full_review": "This is by far the best thing I ever saw about the life of Pablo Escobar and the Colombian crisis. Everything in this show is perfect. The actors are sublime, every actor is very believable in his role. The narrating voice through the whole series works really well to me. Also the real video fragments from the news in that time between the fiction works really well. I was completely addicted to this show after the first episode. I saw the whole season in a couple days. Can't wait for season two honestly. If all series would be at the same level as this one I would probably never set a foot outside anymore and just watch television all day. Narcos will definitely be the show of the year. Great job from Netflix!", "review_date": "25 September 2015", "rating_value": "10"}, {"reviewer_name": "yoentjebbes", "reviewer_url": "/user/ur47245780/", "data-review-id": "rw3314848", "short_review": "Already addicted after first episode!", "full_review": "", "review_date": "11 September 2015", "rating_value": "9"}]}, {"ImdbId": "tt2707408", "reviews": [{"reviewer_name": "floatingpolarbear", "reviewer_url": "/user/ur62513246/", "data-review-id": "rw3313786", "short_review": "Engrossing, sharp crime drama with interesting insights", "full_review": "It's easy to get pulled into this story from the beginning and crave more and more episodes. The scenes are elaborate yet short, giving a natural feel to the story as if you're getting glimpses of a really intimate documentary. Not only is the pace entertaining but the dramatic turning points are fascinatingly portrayed to take you right there in the midst of Colombian society experiencing all these shocking events and inside the minds of the characters on all sides of the battle as they try to calculate their next move. You've got a furious torrent of money coming into a segment of society that is purely made up of sociopaths, an unprepared and underpaid police force being made mincemeat of or simply being paid to look the other way and a political string of characters that range from corruptible opportunists to saintly martyrs trying to stave the tide against impossible odds. The houses that people have, the lifestyle, the restaurants, cafés, streets, types of interactions, all is authentic down to the smallest detail. It's a delight and it has really made me want to pick up a book and read more about this bloody and interesting struggle of good and evil and in between.", "review_date": "9 September 2015", "rating_value": "10"}, {"reviewer_name": "johnfdunphy", "reviewer_url": "/user/ur62497681/", "data-review-id": "rw3311555", "short_review": "wow...", "full_review": "for those of you living under a rock Pablo escobar was...etc etc (from that point on I was hooked. Pablo Escobar is the real life version of \"Baba yaga\" from John Wick. He was one of the richest people on the planet. He was also the largest cocaine trafficker on the planet. He would also be, by today's standards, simply called a terrorist. He murdered anyone who stood in his way and countless other innocents along the way. I've read a few books on Pablo and I have to say this series TOTALLY does justice to the real story. The writing, directing and acting is unbelievable! I have to admit that personally I feel a little dirty because in some of the scenes I am actually empathizing and relating to Pablo...I CAN'T BELIEVE I AM SAYING THAT!!! The people in charge of this series do such a fantastic job in splitting your allegiances. When Pablo's cousin is killed I literally had to shake my head because even though Escobar is an evil disgusting human being who has destroyed countless lives and brought both Columbia and the US to their knees (and I know this intellectually) I can still relate with him and feel his pain and I found myself devilishly routing for him and I was eagerly anticipating his revenge for for that killing...I WAS FEELING FOR PABLO FREAKING ESCOBAR! Then a few scenes later the DEA agent is kissing babies and planning to go outside of the law to bring him down and I'm back routing for these guys to take that evil person off the streets. Rarely have I encountered such a deep and in depth emotional roller coaster as I have experienced watching this show. These guys deserve a ton of credit. Top notch job. I am fascinated and totally engrossed in watching this ideological DEA agent succumb to his primal urge to take out this evil presence regardless of the moral boundaries he has to cross to do so. My favorite quote from the entire series is \"Yeah...I like Olivia\" (It reminds me of the premise of another movie I recently watched called \"The Man of Tai Chi\" which explores the voyeuristic culture we live in where we love to watch innocence being destroyed by the evil that surrounds us). In Narcos this premise is displayed with such skill that I have to bow my head. Complex story, amazing production, and beautiful execution...Bravo Netflix...bravo!", "review_date": "6 September 2015", "rating_value": "10"}, {"reviewer_name": "jorgealeond", "reviewer_url": "/user/ur67793284/", "data-review-id": "rw3680094", "short_review": "HOW PABLO IS Brazilian!", "full_review": "I cannot watch two episodes of this series. When you see that Pablo Escobar,\"El Patrón del Mal\" is Brazilian(Wagner Moura) this series is completely far away from the real life. For Spanish speakers this story is impossible to see, and more if you have watched another series about the life of Pablo. And to non Spanish speakers, i don't know if this series is good or no because i was not able to see it. Horrible mistake Netflix!", "review_date": "7 April 2017", "rating_value": "1"}, {"reviewer_name": "guiselamoro", "reviewer_url": "/user/ur3169295/", "data-review-id": "rw3317145", "short_review": "WORST ACCENTS EVER! what is wrong with the casting department??", "full_review": "This TV series may have a chance with the American audience but not with any of the latino Spanish speaking viewers\u0085 90 percent of the actors playing the lead and principal roles are not Colombian\u0085 and the problem it's not that they are not Colombians, the problem is that they are bad actors who couldn't even work to get the Colombian accent correct. It's embarrassing\u0085 i'm not even Colombian, I was born in Argentina, I'm an American Citizen and it's upsetting that even the lead actor playing Pablo is not Colombian. Just my humble opinion\u0085 The story has a chance but I'm so distracted on every scene by the lead actor playing Escobar every time time he opens his mouth he can't even pronounce correctly some words in Spanish because he was born in Brazil! Bad casting choice, bad directing choice.", "review_date": "14 September 2015", "rating_value": "5"}, {"reviewer_name": "beelink", "reviewer_url": "/user/ur62439476/", "data-review-id": "rw3309803", "short_review": "Pretty weak", "full_review": "", "review_date": "2 September 2015", "rating_value": "4"}, {"reviewer_name": "acilegna-421-108051", "reviewer_url": "/user/ur34980820/", "data-review-id": "rw3309879", "short_review": "Poor casting choices, great production", "full_review": "", "review_date": "2 September 2015", "rating_value": "6"}, {"reviewer_name": "LouieInLove", "reviewer_url": "/user/ur53576145/", "data-review-id": "rw3308675", "short_review": "A Fine Example Of Good TV.... Quality Achieved", "full_review": "", "review_date": "31 August 2015", "rating_value": "9"}, {"reviewer_name": "furry_frankenstein", "reviewer_url": "/user/ur2001084/", "data-review-id": "rw3307633", "short_review": "Good, but not interesting", "full_review": "", "review_date": "30 August 2015", "rating_value": "10"}, {"reviewer_name": "therocksbarneyreviews", "reviewer_url": "/user/ur56373361/", "data-review-id": "rw3350420", "short_review": "Why are people not talking about this fantastic series?!?!", "full_review": "", "review_date": "7 November 2015", "rating_value": "9"}, {"reviewer_name": "sebaslopez-97", "reviewer_url": "/user/ur47755494/", "data-review-id": "rw3337492", "short_review": "It's Overrated", "full_review": "", "review_date": "18 October 2015", "rating_value": "8"}, {"reviewer_name": "ArneArdvark", "reviewer_url": "/user/ur33349122/", "data-review-id": "rw3321484", "short_review": "Portrayal of Escobar left you feeling what a sick and evil man he must have been.", "full_review": "", "review_date": "22 September 2015", "rating_value": "8"}, {"reviewer_name": "aeq-66872", "reviewer_url": "/user/ur62686359/", "data-review-id": "rw3318445", "short_review": "Get a spine, writers", "full_review": "", "review_date": "16 September 2015", "rating_value": "8"}, {"reviewer_name": "ahmadmobeenqazi", "reviewer_url": "/user/ur50508029/", "data-review-id": "rw3311594", "short_review": "Haunting Drama with Outstanding Cast and Unbiased Views.. You'll be Hooked!", "full_review": "", "review_date": "6 September 2015", "rating_value": "10"}, {"reviewer_name": "nirakarnepal", "reviewer_url": "/user/ur123699910/", "data-review-id": "rw6040504", "short_review": "Absolute class", "full_review": "This shows goes on the list of the shows not to miss in your life. There are 3 season with 30 episode and you won't feel bored whole 3 season . It is classy and highly addictive . Based on real life incident of Pablo escobar and cali cartel, this show wins the heart . Full package show :)", "review_date": "29 August 2020", "rating_value": "8"}, {"reviewer_name": "rnf100", "reviewer_url": "/user/ur38638081/", "data-review-id": "rw5875580", "short_review": "Narcos", "full_review": "Excellent portrayal of Pablo and his associates, excellent performances all round\nThey did keep hammering home \" the loving family fan v Ruthless murderer \" a bit too much for me , but it's a fascinating story and top marks to the actor who played Escobar", "review_date": "2 July 2020", "rating_value": "8"}, {"reviewer_name": "g-21936", "reviewer_url": "/user/ur118758173/", "data-review-id": "rw5845322", "short_review": "Narcos", "full_review": "The awkward last minute rescue of the first half was gradually pulled back by the second half. One is painstakingly building a system, the other is cautiously confronting the existing huge system. The reason why the drug war is doomed to be impossible to win is not that the U.S. bureaucracy is too large, nor that Latin American countries are deeply corrupted. But that the drug is a huge profit, 90% of the market is in the U.S. itself, and there are too many reasons for Latin American politicians to support it.", "review_date": "22 June 2020", "rating_value": "9"}, {"reviewer_name": "q-11775", "reviewer_url": "/user/ur115609345/", "data-review-id": "rw5841640", "short_review": "Narcos", "full_review": "Colombia is an indiscriminate hell of violence, while Mexico is an institutionalized fraternity, so although it does not look like the former at first, it finally surmounts the former's madness under the support of more darkness and repression. Netflix has handed over an answer sheet on how to tell the story that has already known the ending, while the United States is hard to find the way to win a doomed war.", "review_date": "21 June 2020", "rating_value": "9"}, {"reviewer_name": "karamiamitis", "reviewer_url": "/user/ur119593940/", "data-review-id": "rw5813649", "short_review": "Brace yourself up", "full_review": "Indeed it's a movie full of surprise, it won't let you to blink for a second. If you want to watch this fantastic movie brace yourself up, and get a bucket full load of popcorn.", "review_date": "10 June 2020", "rating_value": "9"}, {"reviewer_name": "u-32187", "reviewer_url": "/user/ur114626847/", "data-review-id": "rw5803283", "short_review": "narcos", "full_review": "The great thing about this drama is that when you think the drug lord is about to rule the world, there is always the fire of justice ignited; when you think that victory is coming, darkness has been corroding light.", "review_date": "6 June 2020", "rating_value": "8"}, {"reviewer_name": "goswamidiptanshu", "reviewer_url": "/user/ur82541984/", "data-review-id": "rw5766845", "short_review": "Literally one of the greatest Biography Show ever!", "full_review": "Each and every episode is well adapted!the music was phenomenal so does the intro it was amazing.the language at start took little time to adjust with subtitles although i was well connected to the show that Doesn't matter after a while.every criminal arrest with the real footage was great.the acting is literally Iconic every character was perfect as there role specially the Escobar he was great.the team of DEA with Murphy and Pena they both were amazing.the starting 2 season were about the Detailed life of Escobar the up's and down's and the way to arrest him it was quite great how they portrayed it was intense and amazing.the 3rd season felt a step ahead with more Nail-biting twist and jaw-dropping intense situations it was hell of season,the story-line as per biography is well packed no extra things just point to point direction it was professionally awesome.Overall this series is literally surprising and Masterpiece it's really one of the greatest Biography show!", "review_date": "24 May 2020", "rating_value": "10"}, {"reviewer_name": "cseabhi", "reviewer_url": "/user/ur58232116/", "data-review-id": "rw5766054", "short_review": "Narcos shows us the right storytelling way for this genre", "full_review": "Loved this series and the story of Pablo Escobar. Not known to his life or name but then the series lets you know the whole story. Fantastic production and great storytelling. Wagner Moura and Pedro Pescal were amazing in this.", "review_date": "24 May 2020", "rating_value": "8"}, {"reviewer_name": "tuffymusk", "reviewer_url": "/user/ur118292387/", "data-review-id": "rw5730503", "short_review": "Actually interesting", "full_review": "The story was dercribed so well .... With orignal stuffs .... All casting members have done superb work .... So realistic to watch and fell the story .... Good to know the real facts that were happen at 70's .... By pablo escobar and others narcos don", "review_date": "12 May 2020", "rating_value": "10"}, {"reviewer_name": "petritkalkkila", "reviewer_url": "/user/ur60598034/", "data-review-id": "rw5639119", "short_review": "Best crime drama around drug world", "full_review": "For seasons 1 and 2, an easy 10/10.\nSeason 3 is a different chase of drug lords, without the factors that made seasons 1 and 2 so great. Still, the best crime drama around drug world as a whole.", "review_date": "14 April 2020", "rating_value": "9"}, {"reviewer_name": "dixit9", "reviewer_url": "/user/ur35380580/", "data-review-id": "rw5635752", "short_review": "Excellent Series", "full_review": "It is an excellent series which will hook you to the TV. Based in the life of Pablo Escobar . It is in detail and very well performance by the entire team of actors. Well done.", "review_date": "13 April 2020", "rating_value": "10"}, {"reviewer_name": "nnk-39990", "reviewer_url": "/user/ur75904101/", "data-review-id": "rw5630033", "short_review": "Wow !", "full_review": "Loved the way they portrayed the characters so brilliantly , kept us glued , series each and every episode was great .", "review_date": "11 April 2020", "rating_value": "8"}]}, {"ImdbId": "tt2707408", "reviews": [{"reviewer_name": "rtbradford", "reviewer_url": "/user/ur50178817/", "data-review-id": "rw5606625", "short_review": "Entertaining if a bit simplistic", "full_review": "", "review_date": "4 April 2020", "rating_value": "7"}, {"reviewer_name": "erniieduud", "reviewer_url": "/user/ur28586383/", "data-review-id": "rw5312351", "short_review": "Absolutely great, but some slow points.", "full_review": "Loved season 1 and 3. Season 2 was a slow burner for me and didn't get me excited untill the last few episodes.", "review_date": "10 December 2019", "rating_value": "8"}, {"reviewer_name": "zurdulla", "reviewer_url": "/user/ur102895449/", "data-review-id": "rw4922261", "short_review": "Pablo Escobar", "full_review": "Very beautiful actions. I like Escopar and stories about him. Very nice TV show. Pablo is tiger 🐯", "review_date": "8 June 2019", "rating_value": "10"}, {"reviewer_name": "PCT1970", "reviewer_url": "/user/ur99519886/", "data-review-id": "rw4857032", "short_review": "Cut The Head Off The Snake", "full_review": "I've watched many documentaries on drug cartels and although certain names and locations were changed for dramatic purposes, this series is a much better view and more interesting as far as depicting the Columbian cartels during the 80's. This series has excellent direction, cinematography, writing, acting, setting and soundtrack. Along with that Holbrook's and Pascal's subtle and sarcastic narrative adds to the intensity of the series. Pascal, Holbrook and Moura deliver top notch realistic performances. The series depicts the efforts of two agents from different countries working together to take down the cartels and the obstacles they faced. It addresses the drug trade from all points of view including law enforcement, politicians, traffickers, media and the victims left in the wake. The most notable kingpin targeted is Pablo Escobar and unless you've been living under a rock, that name is well known. The plot of the show is nearly flawless and makes it clear as to what it took to take down Escobar. It's captivating throughout the series. The writers made it clear during the three seasons that if you cut off the head of the snake, another figure will be standing in line to take it's place. The ending leaves the viewer with this realization and also eludes to the fact that the story is just beginning. In reality, although these two brave agents made a huge impact on the drug trafficking business during the 80's, the writers are correct. The snake and the business still lives on.", "review_date": "16 May 2019", "rating_value": "9"}, {"reviewer_name": "clkkerem-20362", "reviewer_url": "/user/ur102210959/", "data-review-id": "rw4808472", "short_review": "its very nice", "full_review": "Nice story but i think we have to hate pablo escobar", "review_date": "27 April 2019", "rating_value": "9"}, {"reviewer_name": "misshenaffteacher", "reviewer_url": "/user/ur101400007/", "data-review-id": "rw4769877", "short_review": "Some efforts needed on the soundtrack!", "full_review": "Narcos is a Netflix series which talks about the story of the drug trafficker\nPablo Escobar and his rise in Colombia. The Story is very captivating, the cast, characters and the settings of the 70s were great, but the soundtrack was too poor...", "review_date": "8 April 2019", "rating_value": "6"}, {"reviewer_name": "yettygutschow", "reviewer_url": "/user/ur96316405/", "data-review-id": "rw4688943", "short_review": "Great documentary style TV", "full_review": "Incredible acting, great production quality and flawless execution makes this document style TV show one of the best in years. This is TV at it's best. Lots of violent and sex...but that's what the drug business is.", "review_date": "27 February 2019", "rating_value": "10"}, {"reviewer_name": "c-aristigueta", "reviewer_url": "/user/ur48428707/", "data-review-id": "rw3794713", "short_review": "Great portrait of the Narcos in Colombia-Drawback the cast", "full_review": "After watching Patron del mal, no one can't disagree that the acting is twice better than Narcos. Nevertheless el Patron feels a bit soup opera, Latin telenovela contrary to Narcos more film like, more Hollywood. Conclusion mixing the acting of one with the production of the other one would have delivered an authentic piece of Art. Narcos is a really good show highly recommended. I gave them a 7 and not a 10 because of terrible casting, you cannot use a Brazilian for the role of Pablo that's like watching a film of Lincoln playing with Mexican accent. It just does not work. Pablo's wife Mexican accent, Gacha one of the most relevant Narcos Puerto Rican accent, is just a chaos when you listen all these actors speaking in completely different Spanish accents.", "review_date": "1 September 2017", "rating_value": "7"}, {"reviewer_name": "anseldiama", "reviewer_url": "/user/ur77701303/", "data-review-id": "rw3751966", "short_review": "Genuine review - Ansel Diama", "full_review": "Wow! What a series. I have to admit, I shamelessly watch both season 1 and 2 in one sitting. Every episode has its own unique plot that leads onto the other episode. The acting in this series is spectacular, the cinematography is pleasing. You can tell that this series did not have a light budget. If you are looking for a new series to watch, definitely watch Narcos. You will be hooked by the first episode if not the first 10 seconds of it!", "review_date": "11 July 2017", "rating_value": "10"}, {"reviewer_name": "Toastinger", "reviewer_url": "/user/ur4267036/", "data-review-id": "rw3741196", "short_review": "It's all in the story", "full_review": "This series is an achievement. The story telling is immersive. So much is happening episode by episode. The authentic story is just made round by fictional elements, after each episode you read on Wikipedia about the background story. The characters are really strong, Pablo's facing expression alone is worth watching the series. And Pablo at all, you hate him so much and at least you'll suffer and miss that guy. Watch and see! I'm really sad that it's over now. And I can't imagine how the follow-ups should work without Escobar.", "review_date": "28 June 2017", "rating_value": "10"}, {"reviewer_name": "lonewolf333", "reviewer_url": "/user/ur7788589/", "data-review-id": "rw3723343", "short_review": "Binge watched from beginning to the end of Season 2 so far", "full_review": "", "review_date": "4 June 2017", "rating_value": "10"}, {"reviewer_name": "bks1978-1", "reviewer_url": "/user/ur12884143/", "data-review-id": "rw3697970", "short_review": "Brilliant", "full_review": "", "review_date": "1 May 2017", "rating_value": "8"}, {"reviewer_name": "mariana_mgz", "reviewer_url": "/user/ur37513100/", "data-review-id": "rw3542026", "short_review": "I'd like to see more Colombian actors", "full_review": "", "review_date": "11 September 2016", "rating_value": ""}, {"reviewer_name": "abuarb-68952", "reviewer_url": "/user/ur98424473/", "data-review-id": "rw5314940", "short_review": "2 good chapters , the third is not good", "full_review": "I liked the story of Pablo Escobar ... great story ...\nThe cali story was inconsistent.... if the Colombian Presidente and defense minister are associated with the cartel why did they keep helping the dfa.... moreover.... salasado luck and contribution to the story was silly.... why did they only send a single man to kill polmary and why he did not kill or knock salasado out .... the fact cali cartel was down but i don't think we saw something close to the reality", "review_date": "11 December 2019", "rating_value": "5"}, {"reviewer_name": "strupar-66747", "reviewer_url": "/user/ur77891416/", "data-review-id": "rw4392753", "short_review": "Amazing", "full_review": "First two seasons were awesome, the first season was good, please don't disappoint us in season 4!", "review_date": "12 October 2018", "rating_value": "10"}, {"reviewer_name": "benny-412-342893", "reviewer_url": "/user/ur34757515/", "data-review-id": "rw3317326", "short_review": "Narcos is a FANTASTIC SHOW", "full_review": "", "review_date": "15 September 2015", "rating_value": "10"}, {"reviewer_name": "herbalcoolicg", "reviewer_url": "/user/ur54202719/", "data-review-id": "rw3307790", "short_review": "awesome", "full_review": "", "review_date": "28 August 2015", "rating_value": "10"}, {"reviewer_name": "elsanx", "reviewer_url": "/user/ur62357250/", "data-review-id": "rw3307114", "short_review": "A Brazilian Pablo Escobar who can't speak Spanish? appalling", "full_review": "", "review_date": "29 August 2015", "rating_value": "5"}, {"reviewer_name": "dgjones-62258", "reviewer_url": "/user/ur84479231/", "data-review-id": "rw5499946", "short_review": "Makes The Sopranos Look Like Child's Play", "full_review": "", "review_date": "21 February 2020", "rating_value": "8"}, {"reviewer_name": "abrahamdeniz", "reviewer_url": "/user/ur62367214/", "data-review-id": "rw3307383", "short_review": "Horrible Spanish by main character quite annoying to hear accent", "full_review": "The show is good everyone speaks perfect actual Colombian Spanish except Pablo which is quite annoying since he's the main character and makes no sense because isn't it suppose to to be based on the real Escobar but for all you non Spanish speakers should be no issue. You wont notice it. But over all the story line and rest of the actors are pretty good. very interesting but i just cant get over the accent i here in Pablo's voice. Am sure am not the only one that feels this way. Pretty sure my fellow Spanish speakers can relate to it. Anyways if you can get past that or aren't a Spanish speakers you should watch it. Shows you how the drug lords operate and why some are loved by the people", "review_date": "29 August 2015", "rating_value": "7"}, {"reviewer_name": "jshorowitz", "reviewer_url": "/user/ur64010069/", "data-review-id": "rw5030982", "short_review": "Terrible show far fetched fictitious poor acting", "full_review": "I wouldn't know where to start. This show really has nothing to do with Pablo Escobar. No historical significance whatsoever. Wagner Moura should be teach high school drama class at best. I want a refund from Netflix. Hillary Clinton must curl up in bed at night and watch this.", "review_date": "31 July 2019", "rating_value": "1"}, {"reviewer_name": "hasanbagherikalat", "reviewer_url": "/user/ur118214798/", "data-review-id": "rw6218483", "short_review": "Beyond expectations.", "full_review": "The series is very good. In turn, it is unique. Highly recommended.", "review_date": "30 October 2020", "rating_value": "9"}, {"reviewer_name": "prathameshs-30780", "reviewer_url": "/user/ur103406751/", "data-review-id": "rw6207774", "short_review": "THIS SHOW'S A MASTERPIECE!!!", "full_review": "Such an amazing show. Really liked the way the show is presented to the viewers. After Pablo's death in season 2 i didn't really think the show would survive. But season 3 was really epic. It was more dark and organized unlike the first two seasons.", "review_date": "26 October 2020", "rating_value": "10"}, {"reviewer_name": "jjlawler-98324", "reviewer_url": "/user/ur96869139/", "data-review-id": "rw6182032", "short_review": "Fantastic epic bio fiction", "full_review": "Each episode is like a mini movie. Well acted, and great story. Too bad Colombia remains in the grips of the Narcos. Narcos the series highlights both the US and Colombia side of the Take down of Pablo story. I am on my second go through and it is even better.", "review_date": "17 October 2020", "rating_value": "10"}, {"reviewer_name": "catchuanbu", "reviewer_url": "/user/ur37793921/", "data-review-id": "rw6160526", "short_review": "Detailed and well narrate masterpiece!", "full_review": "", "review_date": "9 October 2020", "rating_value": "8"}]}, {"ImdbId": "tt2707408", "reviews": [{"reviewer_name": "mgmason-28337", "reviewer_url": "/user/ur73297424/", "data-review-id": "rw6029221", "short_review": "Superb series", "full_review": "Can't believe why it has taken me this long to watch the series. But after Gomorrah and Banshee just binge watched. Great acting and storyline. Was just wishing it wouldn't end when the final episode segued into Narcos Mexico. And yes I will be watching the 20 episodes rapido👍", "review_date": "26 August 2020", "rating_value": "10"}, {"reviewer_name": "liamgt-82128", "reviewer_url": "/user/ur123395080/", "data-review-id": "rw6012538", "short_review": "First two seasons great", "full_review": "First two seasons are incredible, loved the Pablo story. However, series 3 was a tough watch to get through, never really clicked with me", "review_date": "20 August 2020", "rating_value": "8"}, {"reviewer_name": "thiagorodman", "reviewer_url": "/user/ur103527650/", "data-review-id": "rw5947105", "short_review": "Narcos: 9", "full_review": "Narcos is impressive, a series based on a true story and portrays it with magnificence.", "review_date": "27 July 2020", "rating_value": "9"}, {"reviewer_name": "davidkaljevic", "reviewer_url": "/user/ur115308767/", "data-review-id": "rw5718361", "short_review": "Overall fun to watch", "full_review": "There are few thing that were annoying season 2 every second shot of escobar is just him sitting with his fat stomach thinking about something i guess that was supposed to make everything look more dramatized but it was just too much and it got boring too quick, season 3 was ok but everything happens to be just in a perfect timing which is giving rythm to episode but its just too much fiction, allot of people don't like escobar because of his brasillian accent i don't know anything beside puta in spanish so i don't care for every non spanish speaker escobar did the best job because of visual side, and last bad thing was just making DEA agents look like brain of everything kinda felt like propaganda i almost forgot im watching barely real thing because of only showing DEA agents anyways if you watch this just because of fun i recommend this but overall too much fiction for something that is supposed to be based on real life.", "review_date": "8 May 2020", "rating_value": "9"}, {"reviewer_name": "joachim_franzen", "reviewer_url": "/user/ur94950302/", "data-review-id": "rw4756026", "short_review": "Incredible serie", "full_review": "Could not stop to watch.\nIt is a great serie about how the Narcos took over a lot of the state of Colombia and how brave men fought back.", "review_date": "1 April 2019", "rating_value": "10"}, {"reviewer_name": "alexlopez-10084", "reviewer_url": "/user/ur100946441/", "data-review-id": "rw4752851", "short_review": "Great series !!!", "full_review": "I've watched this series over and over again. Just because of the great story telling!!", "review_date": "30 March 2019", "rating_value": "10"}, {"reviewer_name": "derezonajazz", "reviewer_url": "/user/ur93204441/", "data-review-id": "rw4723452", "short_review": "Good but first better", "full_review": "I prefer the first seasons revolving around Pablo Escobar. The subsequent story arcs aren't as compelling. In any case great drug trade TV drama!", "review_date": "15 March 2019", "rating_value": "9"}, {"reviewer_name": "TheReelMovieMaven", "reviewer_url": "/user/ur50891204/", "data-review-id": "rw4719843", "short_review": "Frightening, thrilling, fabulous", "full_review": "This is the BEST series ever on Netflix. Engrossing, adrenaline-rousing action; absolutely believable and sometimes bone-chilling acting; great cinematography.... capped by a superb performance by Wagner Maura as Pablo Escobar. He aptly conveys the charisma that the real Escobar (not as good looking as Maura) must have exuded. This series will take you on a dark rollar-coaster ride that will leave you breathless to see the next episode.", "review_date": "13 March 2019", "rating_value": "9"}, {"reviewer_name": "aleenairshad-31691", "reviewer_url": "/user/ur90398198/", "data-review-id": "rw4620634", "short_review": "Excellent piece of work", "full_review": "At first, I wasn't ready to watch this show but somehow I convinced myself and watched The first 2 seasons. And all I have to say is that it is faar beyond what I expected from it. All the actors have justified their role. I really loved that narrative part ( I have just fallen in love with Murphy's voice). All in all, it is a \"must must watch\" series.", "review_date": "1 February 2019", "rating_value": "10"}, {"reviewer_name": "shelkesagar-37522", "reviewer_url": "/user/ur71409256/", "data-review-id": "rw4575575", "short_review": "A complete entertaining package", "full_review": "If you like crime action drama series then Narcos will never disappoint you. The storyline and how it progresses is amazing to see. The story revolve around the Pablo Escobar a druglord of Columbia. How he started and how he was mentioned in Forbes magazine this all is like entertaining to see. And also it covers story after the death of Pablo Escobar. So it will really entertain you throughout the series. 😁", "review_date": "11 January 2019", "rating_value": "9"}, {"reviewer_name": "albert-balvers", "reviewer_url": "/user/ur24630341/", "data-review-id": "rw4573378", "short_review": "Like drugs this series is addictive...", "full_review": "I started watching Narcos and although I am not an typical bingwatcher, the series proved to be quite addictive, almost like the drugs Pablo Escobar earned his billions with. Of course it is a matter of taste if you like the series. The frequent voice over could be annoying, Pablo reminds me in his last months of Adolf Hitler in Der Untergang, there is a lot of violence, but acting, directing and producing is great and after every episode you think \"ah, just one more...\". It is fascinating to see how series like this are developing. We have seen The Wire, maybe the all-time standard, but then there were many more, like Peaky Blinkers, Breaking Bad or Billions. For me, Narcos is certainly among the best!", "review_date": "10 January 2019", "rating_value": "9"}, {"reviewer_name": "greatcoder", "reviewer_url": "/user/ur77674372/", "data-review-id": "rw4510733", "short_review": "Awesome and Gripping", "full_review": "The first 3-4 episodes were boring and I was losing interest. Somehow I kept continuing and then It started to become better and better. I am now hooked into it. This is really getting addictive. Hence my advice would be to bear initial 4 episodes and then you will fall in love with it.", "review_date": "14 December 2018", "rating_value": "9"}, {"reviewer_name": "yettygutschow", "reviewer_url": "/user/ur96316405/", "data-review-id": "rw4510409", "short_review": "Tough, gritty, and full of violence...it's great", "full_review": "An extremely entertaining recreation of the events in Columbia. Great acting, superb writing, and beautiful and effective sets lend a hand in the storytelling. Character development is probably the most important aspect that makes this series one of the best.", "review_date": "14 December 2018", "rating_value": "10"}, {"reviewer_name": "isaacccoder", "reviewer_url": "/user/ur95344233/", "data-review-id": "rw4508618", "short_review": "Another great season.", "full_review": "Well done, moving to mexico did nothing but elevate an already yearly bingeworthy series. good story, great characters, great casting Michael, Peña one of the most watchable journeymen actors in the business, and Diego Luna brings it. they set up a next season (natch) and I hope Netflix bites.", "review_date": "13 December 2018", "rating_value": "8"}, {"reviewer_name": "kevinsteele21", "reviewer_url": "/user/ur39948505/", "data-review-id": "rw4502690", "short_review": "Absolutely class", "full_review": "Wagner moura in his performance as pablo for me is best portrayal of any true story ever . I can't think of a better performance. Class show", "review_date": "9 December 2018", "rating_value": "10"}, {"reviewer_name": "jonnyjags", "reviewer_url": "/user/ur72191038/", "data-review-id": "rw4446114", "short_review": "Compelling, Exciting and Addicitve", "full_review": "", "review_date": "8 November 2018", "rating_value": "10"}, {"reviewer_name": "uribehector", "reviewer_url": "/user/ur94869687/", "data-review-id": "rw4442782", "short_review": "Great Show", "full_review": "The writers do a great job in Season 3 of maintaining the engagement, through showing several characters, good, bad and neutral, and how the events affect them, plus making the plot development incredibly nail-biting.", "review_date": "7 November 2018", "rating_value": "8"}, {"reviewer_name": "wafeekeid", "reviewer_url": "/user/ur68987387/", "data-review-id": "rw4418769", "short_review": "Impressive", "full_review": "", "review_date": "25 October 2018", "rating_value": "10"}, {"reviewer_name": "prnvparashar", "reviewer_url": "/user/ur92914580/", "data-review-id": "rw4353436", "short_review": "A CRIME SAGA WORTH WATCHING!!!!!", "full_review": "The show takes the viewer through a roller-coaster ride making him/her experience the thrill and suspense of witnsessing the rise and fall of rival cartels with an immensly interesting narrative in the background !!! truly. a must watch !!!", "review_date": "22 September 2018", "rating_value": "10"}, {"reviewer_name": "grantss", "reviewer_url": "/user/ur2860723/", "data-review-id": "rw4171360", "short_review": "Magnifico!", "full_review": "", "review_date": "20 May 2018", "rating_value": "10"}, {"reviewer_name": "Luigi Di Pilla", "reviewer_url": "/user/ur1634796/", "data-review-id": "rw3848551", "short_review": "Narcos hit my heart", "full_review": "Narcos was a great and in a way emotional adventure trip that broke my heart. Despite many violence and bloody scenes it offers top entertainment and non stop adrenaline. The best I liked was the very excellent performance of Wagner Moura, Pedro Pascal and all the other actors that played their roles cool and very credible. I want to thank all of you, each of you deserved an Oscar or other kind of awards. I am thinking already to watch it again. The intro song is always very nice to hear. It gives those mini series the right atmosphere and kick to start the Narcos thrill. 10/10. If you liked this genre of series you shouldn't miss Breaking Bad.", "review_date": "3 November 2017", "rating_value": "10"}, {"reviewer_name": "nassosk", "reviewer_url": "/user/ur10061295/", "data-review-id": "rw3827051", "short_review": "Great show", "full_review": "", "review_date": "9 October 2017", "rating_value": "9"}, {"reviewer_name": "evanfoster-76101", "reviewer_url": "/user/ur72554370/", "data-review-id": "rw3710723", "short_review": "A True Thriller, and an Even Truer Netflix Masterpiece", "full_review": "Netflix does it again. They managed to make one of the world's most thrilling stories and perfectly capture it through a masterful script and gorgeous directing. Without a single misstep, this show is constantly asking you to try and keep up, as its brilliance always has you craving for more, yet it always seems to surpass your wildest dreams and expectations. What makes this thriller so unique is that it's ending, and almost entire plot, is well known and documented by the audience ahead of time. However, the show is able to deviate away from the typical plot line a bit, as well as deviate away from the stereotypical characteristics of an action thriller. It does so by also making this series have aspects of a drama, evoking pathos and ethos frequently throughout the series. Even more surprisingly, it is able to successfully evoke these emotions in the audience towards unexpecting characters: both the heroes and the villains of the series. This series cannot be compared to many of Netflix's other masterpieces, because this series is highly different from all the rest, and sits well on top of the podium for its own highly unique genre.", "review_date": "18 May 2017", "rating_value": "9"}, {"reviewer_name": "miketantarelli", "reviewer_url": "/user/ur55028464/", "data-review-id": "rw3605076", "short_review": "Season 3 Anyone???", "full_review": "I loved this show. I am a huge Horror fan, that's about 90% of the movies that I I watch are, and I'm not a huge \"series\" type person. It's hard for me to Invest that much time just for TV. I have always had a fascination with the \"Ctime Culture,\" and the Underworld. I dig Gangster movies and prison movies and such. So I thought I'd give the show a shot(no pun intended). I'm glad I did. It was wonderfully written and the cinematography I thought was excellent. It wasn't just in a city or a house, just in the jungle, they utilized all they had at their disposal, and it showed. It was beautiful. The characters were pretty well developed. You found yourself empathizing with Pablo Escobor, it sounds strange I know. But you really see he was just a man trying to take care of his family the best way he knew how. I would have loved to see this series be at least 3 seasons long. I feel that there would have been plenty more of Pablo's escapades to write about. So I was slightly disappointed that the end of season 2 was going to be the final episode of the series. I don't think it will be. The way it ended says to me there will be another season or 2. I'm stoked. I loved the first 2 seasons and I'm looking forward to the next one. 2 thumbs up.", "review_date": "23 December 2016", "rating_value": "10"}, {"reviewer_name": "anakin-14611", "reviewer_url": "/user/ur69903794/", "data-review-id": "rw3586556", "short_review": "Beware: Highly addictive show", "full_review": "", "review_date": "26 November 2016", "rating_value": "10"}]}, {"ImdbId": "tt2707408", "reviews": [{"reviewer_name": "mobeenpat", "reviewer_url": "/user/ur46684159/", "data-review-id": "rw3554035", "short_review": "Superb show better than GOT", "full_review": "Man Wagner Maura will always will be close to my heart for his Pablo escobar role.i wished they would have removed the death part and take that Pablo rose again to his power reclaiming his throne and become presidante .Pablo escobar was a person that must be killed but Wagner role made me his follower his ego,power,body language man give me a break all were superb. i never cried in any movies or show if i recon but the final scene where Pablo meets Gustavo man heart breaking i lost the count playing the scene again and again i wished Wagner continued till season 4 because i have no more interest watching the rest of the season.I didn't started to watch Narcos because of him but i will stop watching because of him i just wish Pablo became EL-PRESIDENTE just in the show man.I HAVE NOTHING TO DO MORE CAUSE NARCOS IS OVER AND HAVE NO Interest IN 3-4 SEASON OR AMURICANS", "review_date": "1 October 2016", "rating_value": "10"}, {"reviewer_name": "sinhaki", "reviewer_url": "/user/ur38045074/", "data-review-id": "rw3550171", "short_review": "Real Deal with Sound Drama", "full_review": "", "review_date": "24 September 2016", "rating_value": "10"}, {"reviewer_name": "marcusdick", "reviewer_url": "/user/ur68976336/", "data-review-id": "rw3548856", "short_review": "So good I watched both seasons in a week and went to work still👍", "full_review": "", "review_date": "22 September 2016", "rating_value": "9"}, {"reviewer_name": "alexeast-74402", "reviewer_url": "/user/ur68168264/", "data-review-id": "rw3537541", "short_review": "Hits all the right notes - without pretending to be a 100% accurate account of Escobar's life and times.", "full_review": "", "review_date": "3 September 2016", "rating_value": "8"}, {"reviewer_name": "steven98664", "reviewer_url": "/user/ur35027488/", "data-review-id": "rw3490029", "short_review": "Excellent", "full_review": "", "review_date": "18 June 2016", "rating_value": "9"}, {"reviewer_name": "martaslp", "reviewer_url": "/user/ur26651038/", "data-review-id": "rw3446493", "short_review": "Seriously impressed!", "full_review": "", "review_date": "6 April 2016", "rating_value": "9"}, {"reviewer_name": "amesmonde", "reviewer_url": "/user/ur1761695/", "data-review-id": "rw3325478", "short_review": "Tension filled and fast paced", "full_review": "", "review_date": "29 September 2015", "rating_value": ""}, {"reviewer_name": "kandarkarg", "reviewer_url": "/user/ur73123434/", "data-review-id": "rw5920059", "short_review": "The best crime, thriller web series on Netflix", "full_review": "Narcos is the best web series available on Netflix till date. Even better than the most overrated web series like game of thrones and breaking bad at least in my opinion. Revolving around the true incidents in history the series is a combination of best acting, suspense and drama. A very gripping, captivating, intense series. Must watch for everyone", "review_date": "20 July 2020", "rating_value": "10"}, {"reviewer_name": "ronaldtremblay", "reviewer_url": "/user/ur86975205/", "data-review-id": "rw4112207", "short_review": "What's up with the subtitles!", "full_review": "Narcos the show has real potential but for the subtitles! This show is very well written and produced. But trying to focus on the action while reading the subtitles is just too distracting. Honestly if I want too read I'll visit my local library. I sure hope this doesn't become the norm for Netflix. Because I'm not going to pay a monthly subscription too read subtitles !!!", "review_date": "1 April 2018", "rating_value": "1"}, {"reviewer_name": "cordenw", "reviewer_url": "/user/ur46485353/", "data-review-id": "rw3811511", "short_review": "Lousy acting by the leads", "full_review": "", "review_date": "21 September 2017", "rating_value": "4"}, {"reviewer_name": "osama32367", "reviewer_url": "/user/ur50295669/", "data-review-id": "rw6238786", "short_review": "ALL OR NOTHIN", "full_review": "Pablo was incredibly genius\nAll or nothin...Pedro amazing\nReminded me if great late Charles Bronson..watch it..", "review_date": "5 November 2020", "rating_value": "9"}, {"reviewer_name": "soprano-69707", "reviewer_url": "/user/ur69865776/", "data-review-id": "rw5937780", "short_review": "High addictive TV shows", "full_review": "This is perfection.. The story, the acting, the script and the music who give the final touch.. Just incredible to make so many seasons with so high qualities in every details of this very dramatic and sad true story..", "review_date": "25 July 2020", "rating_value": "10"}, {"reviewer_name": "mostaqim", "reviewer_url": "/user/ur115173511/", "data-review-id": "rw5927435", "short_review": "It is a must watch series.", "full_review": "The Incredible Story of Pablo Escobar and the Cali Cartel.Narcos is an educating and entertaining series. Netflix again done a very good job. Season 1 & 2 tells the true story of ruthless drug kingpin Pablo Escobar, who became a billionaire through the production and distribution of cocaine, while also focusing on Escobar's interactions with drug lords.Season 3 tells the story of the Cali Cartel,how they were brought down even they were so powerful and smart.This is a massive story. Escobar's life has attracted my attention too.From This show you can know about Medellin Cartel and Cali Cartel which is a very interesting topic.Pablo Escobar and Gilberto Rodríguez both had much influence on the political system than i thought.Wagner Moura is an excellent actor and he learned Spanish just for the Pablo Escobar's role.Boyd Holbrook and Pedro Pascal were great also.I missed Boyd Holbrook in season 3.I don't know why they didn't cast him.The complicated story of Pablo Escobar is portrayed perfectly.Thanks to Netflix for such a powerful, incredible production. I would recommend this show to all my friends and anyone looking for a great show to watch. This is one of the best shows I've seen in a while.", "review_date": "23 July 2020", "rating_value": "9"}, {"reviewer_name": "bhagavathiprasaddd", "reviewer_url": "/user/ur104252676/", "data-review-id": "rw5904643", "short_review": "Must watch series 👌👌👌", "full_review": "Based on true events it has been filmed very well and the acting of the cast keeps the show on top and the third season is best of all.", "review_date": "13 July 2020", "rating_value": "9"}, {"reviewer_name": "julian-42977", "reviewer_url": "/user/ur97241453/", "data-review-id": "rw5904078", "short_review": "Getting better all the time", "full_review": "I have just finished watching the 3 episodes and all I can say, man, it's cool. Season 2 is better than Season 1, while season 3 is probably the best. Definitely worth watching.", "review_date": "13 July 2020", "rating_value": "9"}, {"reviewer_name": "ravindrav", "reviewer_url": "/user/ur76572492/", "data-review-id": "rw5850293", "short_review": "Two seasons - simple awesome", "full_review": "Liked first two seasons but didn't find third one that exciting. It was bit slow. Loved the characterizations of Pablo Escobar and his friend Gustavo. Felt bad when his friend and he gets killed even though he was a drug dealer. Good thing about this series is it shows both good and bad things that happened in Escobar's life. In one way, he was a hero. But when you do it in wrong way, it definitely needs to be stopped and that's what was his life story. Excellently portrayed .", "review_date": "24 June 2020", "rating_value": "9"}, {"reviewer_name": "crravikiran-93443", "reviewer_url": "/user/ur76329233/", "data-review-id": "rw5664351", "short_review": "Only First two seasons were good", "full_review": "The first two seasons which showed us the life of drug lord Pablo Escobar was good. After that the show became boring", "review_date": "22 April 2020", "rating_value": "7"}, {"reviewer_name": "jashezilla", "reviewer_url": "/user/ur69290566/", "data-review-id": "rw5137583", "short_review": "Takes a while to get going but you better buckle-up.", "full_review": "Narcos starts off very slow and takes a while to find it's groove, but when it finds it, man does it get good. Characters good & bad are amazingly well-defined and the intense story just keeps getting better and better.", "review_date": "23 September 2019", "rating_value": "7"}, {"reviewer_name": "manugw", "reviewer_url": "/user/ur63251546/", "data-review-id": "rw4608313", "short_review": "What an entertainment!!", "full_review": "It has it all great script, great production, good settings, care to detail, right timing and crafted visual effects on violent scenes. Great performers. Sex, violence, cruelty, drama and action blended to deliver huge. Superb from beginning to end. Based on true events.", "review_date": "26 January 2019", "rating_value": "10"}, {"reviewer_name": "munirajmeena-24536", "reviewer_url": "/user/ur80457622/", "data-review-id": "rw4466078", "short_review": "Masterpiece", "full_review": "One of the greatest show ever made in the history . Full on entertaining ,twist and turns,suspense ,etc. Everything is lies in this show .#great one .", "review_date": "18 November 2018", "rating_value": ""}, {"reviewer_name": "alexperkins-94375", "reviewer_url": "/user/ur93375979/", "data-review-id": "rw4384520", "short_review": "juicy", "full_review": "This was so good. I learnt a lot too, It was very informative. I loved the acting and i didn't want it to finish. Best series of the year", "review_date": "8 October 2018", "rating_value": "9"}, {"reviewer_name": "kuashie", "reviewer_url": "/user/ur33907673/", "data-review-id": "rw3559591", "short_review": "A gem in a sea of crap.", "full_review": "", "review_date": "10 October 2016", "rating_value": "10"}, {"reviewer_name": "jack_jones_devil", "reviewer_url": "/user/ur23046680/", "data-review-id": "rw3546169", "short_review": "Entertaining and a bit shallow", "full_review": "", "review_date": "18 September 2016", "rating_value": "7"}, {"reviewer_name": "marcu_ioana_a", "reviewer_url": "/user/ur21632029/", "data-review-id": "rw3327534", "short_review": "This show is pure talent, it is art, it's got it all!", "full_review": "", "review_date": "2 October 2015", "rating_value": "10"}, {"reviewer_name": "coconuts33409", "reviewer_url": "/user/ur22752890/", "data-review-id": "rw3318093", "short_review": "Best Series Since Miami Vice", "full_review": "The only reason I gave it a 9 instead of the 10 is 1. The crappy looking Florida license plates in episodes 1 & 2 look like they were made on a copy machine (Florida also did not have front license plates in the 80's). And 2. They could have done without the extreme sexual content severely limiting their audience especially since nowadays extreme violence is more tolerable than extreme sexual situations. Other than those two hiccups, this series is superbly shot, directed; the acting is phenomenal; the filming locations are spot on, the dialects are incredibly accurate. I don't know who this producer is, but they have done a perfect job with the story line, characters, and actors. This series is deserving of any and all filming/acting awards known to man.", "review_date": "16 September 2015", "rating_value": "9"}]}, {"ImdbId": "tt2707408", "reviews": [{"reviewer_name": "Watch-or-Not", "reviewer_url": "/user/ur62583711/", "data-review-id": "rw3314797", "short_review": "Narcos is the Best TV Series I Have Watched", "full_review": "", "review_date": "11 September 2015", "rating_value": "10"}, {"reviewer_name": "mynameis-03073", "reviewer_url": "/user/ur62535313/", "data-review-id": "rw3312712", "short_review": "Highly Recommended", "full_review": "I just binged watched the first season of \"Narcos\" in two days, and I can't wait for Season 2....Does anyone know if there will be a second season?....I'm crossing my fingers....I wanted to review it because I thought it was great and I hope that by \"word of mouth\" it will get more viewers. It deserves it. Everything that has been said positively about it, I agree with: storyline, direction, acting, screenplay, scenography, editing, and the production are top notch. My only slight disappointment was the \"non-Spanish\" accent I detected on the actor that plays Escobar from the get go, and my Google search told me that he's Brazilian, which made sense. The question of \"why didn't they find/couldn't they find\" a Colombian actor for this part crossed my mind. HOWEVER, Mr. Moura does have the \"paisa\" sing-song way of speaking down to a \"T\", and his acting is very good, which made it easy for me to involuntarily forget about that detail. Besides, the rest of the main and supporting cast is so good and they bring together such a good balance, that it made the story and the relationships between all the characters flow very smoothly. My main dislike was Mr. Luis Guzman's characterization of Gacha because I feel that the actor, who is of Puerto Rican ascent in real life, could not give his character a more South American flavor. I think Mr. Guzman was a miscast 100%. Also, I found highly interesting that so much real footage from different events that occurred during that time was added. Overall, I was extremely impressed with the production level. Fantastic job, Netflix! BTW - for those reviewers that had a real problem with Mr. Moura's non-Colombian accent, I suggest you listen again, or for the first time, Al Pacino's accent on \"Scarface\". Just awful and ridiculous. Mr. Moura's \"not real\" Colombian accent is not even a 1/8 of that \"not real\" Cuban train wreck, and that was Al \"Oscar Winner\" Pacino.", "review_date": "8 September 2015", "rating_value": "9"}, {"reviewer_name": "lawrencefishler", "reviewer_url": "/user/ur62529538/", "data-review-id": "rw3312509", "short_review": "One Of The Best Shows Of The Year", "full_review": "Narcos is a show on Netflix that is a biographical drama about the rise and fall of the most notorious drug lord in all of Colombia, Pablo Escobar. Narrated by DEA agent Steve Murphy, this show has a little bit of everything in it but mostly the major things that makes a show a masterpiece , Violence,Drugs,Sex,and more Violence. This show is almost 93% Spanish, so if you are native or know this language, you don't have to use and read the subtitles. If not, you have to read the subtitles to understand what is said by the people in Colombia. This series is about 8 and a half hours long but it is very entertaining to watch. However, this series is VERY VIOLENT and can be very hard to watch with the thought that anything can happen in any time, let alone place. The sex and nudity is in between mild and extreme because the second episode has about 5 sexual scenes {not a spoiler but a warning}. The language and profanity is Extreme which is both in Spanish and English but the violence is most detailed. OVERALL-SHOW-17+ OR ABOVE", "review_date": "7 September 2015", "rating_value": "9"}, {"reviewer_name": "leafclover78-1", "reviewer_url": "/user/ur20734766/", "data-review-id": "rw3310536", "short_review": "Surfing the Narco's wave", "full_review": "Was really looking forward to this Series when i first red about it and ... not at all disappointing!!! The main thing that stroke me was the non Hollywood like production vibe (that i was actually expecting). The vibe is more genuine and noir (in a way) and really authentic (film locations and Spanish speaking actors!) The Spanish speaking really ads up to genuine vibe (I was really surprised!) many non main characters are actually Colombian with the Colombian Spanish accent (well done!). Reconstruction with details (clothing, military uniforms, vehicles etc...) are precise and you can tell there was genuine history research. Kudos! Only eventual downside to it is that, although actors are terrific, Pablo's Character (+ mother and wife) might not be welcome in a proper way by South American audience As they clearly don't speak in Colombian Spanish. Indeed in 2011 to 2012 a Colombian production about Escobar's history aired and made a HIT. The actor doing Escobar remains THE reference for Escobar (true Pablo's tone and accent) Make no mistake though, Wagner Moura performs greatly and really fits the Character. But his Spanish accent ...", "review_date": "4 September 2015", "rating_value": ""}, {"reviewer_name": "chunkylefunga", "reviewer_url": "/user/ur8554198/", "data-review-id": "rw3309487", "short_review": "Another Hit For Netflix", "full_review": "", "review_date": "2 September 2015", "rating_value": "8"}, {"reviewer_name": "michellejenae-19503", "reviewer_url": "/user/ur63155080/", "data-review-id": "rw3334028", "short_review": "Good for watching, bad for animals", "full_review": "I watched the first episode last night, and I like this show and I like where it's going, but the animal abuse in this show adds nothing to the plot and is (always) unnecessary. They feature a horse more than once being forced to carry around a full grown man on his or her back while doing this stupid fast walk to the music. They also show caged chickens. Animals used in the entertainment industry are always harmed. The most effective way to force an animals to do meaningless tricks on demand is with negative reinforcement. The company that says \"no animals were harmed in the making of this show\" is a lie, and that is because they don't monitor the treatment of the animal off set (such as the training methods or the living conditions of the animal), nor do they monitor the treatment of the animals when the camera isn't rolling. That means abuse between takes is totally allowable. On top of that, they are self-regulated, and have been caught on multiple occasions providing this seal of approval even though there is documented animal abuse and even death occurring during filming. Once the animal is old and no longer considered usable for entertainment, they are often warehoused or cast to roadside zoos where they spend the rest of their lives languishing in deplorable conditions. I assume that the animal abuse carries on throughout the show, considering it was so prevalent in the first episode. Narcos would be an ever better show if it stopped supporting animal abuse and perpetuating the idea that intelligent animals are ours to use for cheap entertainment.", "review_date": "12 October 2015", "rating_value": "4"}, {"reviewer_name": "albarracingiovanny", "reviewer_url": "/user/ur107970370/", "data-review-id": "rw5135747", "short_review": "Don't like it", "full_review": "The cast was not colombian at all, they even did not have the proper accent. I stopped watching the show when I noticed it.!!!", "review_date": "22 September 2019", "rating_value": "4"}, {"reviewer_name": "jojoozzie", "reviewer_url": "/user/ur62387267/", "data-review-id": "rw3308025", "short_review": "GREAT, but...", "full_review": "Outstanding. But why the subtitles? I hate them. As I'm reading the subtitles, I'm taking my eyes off the action. I hate subtitles so much, I never watch a movie that has them. This series was the exception, it was so good, I put up with them. I would have given a 10 rating, but did I mention I HATE SUBTITLES!!!!!! OK, I have just been rejected because my review was not long enough. So I guess I will just have to put up with this rule because I really want to submit my review. OK, now I'm going to resubmit to see if it's long enough. Well, I just got rejected again. I'm being told that my review is still too short. I will use this opportunity to express my opinion that this is really a stupid rule. I'll now try again.", "review_date": "30 August 2015", "rating_value": "9"}, {"reviewer_name": "amufan", "reviewer_url": "/user/ur64564315/", "data-review-id": "rw4753610", "short_review": "I HATE SUBTITLES! Not authentic .", "full_review": "I have read the Spanish speaking Parts of the show made it \"authentic\", I say good writing, directing, And acting make a movie or show Authentic. All you have to do is watch the movie Scarface. If I wanted to read I pick up a book. I truly want to be able to rate this show Much higher but I cannot. You release the show or movie in the United States have the courtesy to do so in our native language, English! I will not apologize for expecting any less. You want our money and appreciation for your work, then please respect your viewers. I do not expect to go into another country and have them learn my language I would ask the same of everyone else. It is ridiculous many of those who have reviewed the show do you not the only way I could feel authentic is to have read subtitles . I suffered through season one but not sure I'll be able to make season two or three. Perhaps if there is a four he will show us the courtesy have all the dialogue in English, there are many excellent Hispanic actors to speak both languages and in fact sound authentic even when they are speaking English.", "review_date": "31 March 2019", "rating_value": "2"}, {"reviewer_name": "eng-majd-altujjar", "reviewer_url": "/user/ur56132366/", "data-review-id": "rw5782026", "short_review": "Epic first two seasons, 3rd season sucks", "full_review": "", "review_date": "29 May 2020", "rating_value": "9"}, {"reviewer_name": "charliegeeza", "reviewer_url": "/user/ur2513675/", "data-review-id": "rw4418795", "short_review": "Not the 8.8/10 series I expected", "full_review": "", "review_date": "25 October 2018", "rating_value": "7"}, {"reviewer_name": "ARCo10", "reviewer_url": "/user/ur30432966/", "data-review-id": "rw3846977", "short_review": "Watch only the second season, that's all you need", "full_review": "This series surprises me for the acting more than the story. The narcos reality hadn't heroes but martyrs, characters like the president or the DEA agents were created as moral persons just for dramatic reasons, I guess. If you want to watch it because everybody is talking about it just watch the second season where the acting, the suspense, the twists, and even the final were well constructed.", "review_date": "1 November 2017", "rating_value": "8"}, {"reviewer_name": "mehdialavitabar", "reviewer_url": "/user/ur30581127/", "data-review-id": "rw3369025", "short_review": "This show has something that you never find on any others.", "full_review": "", "review_date": "9 December 2015", "rating_value": "10"}, {"reviewer_name": "Okonh0wp", "reviewer_url": "/user/ur0204528/", "data-review-id": "rw3314904", "short_review": "Engaging and fascinating ride", "full_review": "", "review_date": "11 September 2015", "rating_value": "9"}, {"reviewer_name": "twarrenim", "reviewer_url": "/user/ur67766432/", "data-review-id": "rw3608752", "short_review": "Netflix Fails Again", "full_review": "", "review_date": "29 December 2016", "rating_value": "2"}, {"reviewer_name": "mattea-01204", "reviewer_url": "/user/ur98858996/", "data-review-id": "rw4634464", "short_review": "Animals being killed", "full_review": "Finally I decided to watch \"narcos\".\nFirst episode - great 10/10\nSecond episode - disaster! Why?\nPlot was fine ... but they killed 2 animals\nI can watch almost everything but when it comes to animals being killed i draw the line .. it was really unnecessary!!", "review_date": "9 February 2019", "rating_value": "3"}, {"reviewer_name": "dbrownridge", "reviewer_url": "/user/ur14039350/", "data-review-id": "rw3803122", "short_review": "A great start, then 'clunk'... What the ...?!", "full_review": "You really have to wonder what the writers are imbibing in when they write this stuff. Case in point: Season 3, Episode 3: the DEA and Columbian cops serve a warrant on a Cali brothers office. The Cali accountant is upstairs with a bunch of U.S. cash on the table and his notebook with all the secret names. Do the DEA find it? (I'm whispering here, good gracious I wouldn't want IMDb to think I was shouting... oh goodness...) ..... Of course not. (...is an exclamation allowed?.. oh goodness me, I don't know...) They're too foolish. Inside the large office they search all the clerk desks - But do they search the boss's office? Oh yeah, one guy walks around it, in the dark, for 5 seconds - It's all good. Meanwhile the supposedly smart DEA guy, he doesn't even think to go look himself. Come on. They pack up boxes of clerical stuff from the plebes BUT don't think to really search the boss's office. This story hole is as big as a black hole and just sucked the life out of me. I am in China, we don't get a lot of good Western movies or TV shows. When I find one I am so happy. And I was really excited about Narcos, just started it. This is the worst feeling ever - a show sucks you in with good writing then suddenly when you are hooked, a boot to the head. Nothing is more infuriating than this. Even worse, you have to wonder if the writers really care about the audience. Maybe cash is all they care about, sorry, is all they care about. I guess 'integrity' isn't in their lexicon, obviously. As a writer myself, it's impossible to see myself doing such an idiotic thing, like painting something marvelous then stabbing a hole in it. Brutal.", "review_date": "11 September 2017", "rating_value": "2"}, {"reviewer_name": "portacoeliproductions", "reviewer_url": "/user/ur62365131/", "data-review-id": "rw3307285", "short_review": "Good show with bad accents", "full_review": "The show is very entertaining and touch a lot of the well documented life of Pablo Escobar and the rest of The Cartel. Everything looks legit, the only thing I dislike and I'm pretty sure a lot of Latinos will agree is that casting a Brazilian to do the most famous Colombian of all time is whack, the guy can't pronounce Spanish properly, let alone the distinctive Colombian accent.I guess since it's a Brazilian production they wanted one of their own. But if you don't care about the bad accent, then Narcos is a good show for you. It's a great touch to use actual footage of Colombia (1989-93) and many of the picture of the era. Still, the only reason I can't give 10/10 is because of the accents ( Luis Guzman, a fine Puerto Rican actor, as Rodriguez Gacha is plain dumb ).", "review_date": "29 August 2015", "rating_value": "8"}, {"reviewer_name": "thebricks", "reviewer_url": "/user/ur37569728/", "data-review-id": "rw4466951", "short_review": "Excellent show but it glorifies criminals", "full_review": "", "review_date": "18 November 2018", "rating_value": "7"}, {"reviewer_name": "carlos_correa_98", "reviewer_url": "/user/ur6452068/", "data-review-id": "rw3800578", "short_review": "Not accurate with historical facts and Main Characters Accents", "full_review": "", "review_date": "8 September 2017", "rating_value": "7"}, {"reviewer_name": "enzoalves-47155", "reviewer_url": "/user/ur76540892/", "data-review-id": "rw3713389", "short_review": "Narcos", "full_review": "The name of the series is Narcos. It's a series of the criminal kind. This series comes from the United States. The original language are English and Spanish. There are four seasons. There are twenty episodes that have been broadcast. This is a series on drug trafficking in Columbia. It is a realistic series.", "review_date": "22 May 2017", "rating_value": "7"}, {"reviewer_name": "aaakachh", "reviewer_url": "/user/ur47495482/", "data-review-id": "rw5891581", "short_review": "2 perfect seasons then trash", "full_review": "I wish i didnt start watching the 3rd season\neverything went great before that twist", "review_date": "8 July 2020", "rating_value": "8"}, {"reviewer_name": "creepybby", "reviewer_url": "/user/ur66074337/", "data-review-id": "rw5519603", "short_review": "Not Bad, but A little Full of Itself", "full_review": "", "review_date": "1 March 2020", "rating_value": "6"}, {"reviewer_name": "lamborghinia", "reviewer_url": "/user/ur64867791/", "data-review-id": "rw3398876", "short_review": "Great series, very authentic", "full_review": "So i saw the Trailer of Narcos on an image board and i was hyped from the very beginning. I binge-watched the series multiple times and i couldn't get enough, so i watched a documentation about Escobars Son and i bought the biography of Escobar. After reading the biography, the series gets even more authentic, because it's not exaggerated (like e.g. Braveheart was), it's a documentation packed in a cool, thrilling series. A great plus is that the \"colombians\" speak Spanish, so it's realistic (even tho i had to read a lot of subtitles, because i watched the series in English/Spanish with English subtitles and my mother tongue is swiss German).", "review_date": "20 January 2016", "rating_value": "10"}, {"reviewer_name": "jeffpsy", "reviewer_url": "/user/ur57729378/", "data-review-id": "rw3380286", "short_review": "One of the best of the year", "full_review": "I initially avoided watching Narcos, because I was expecting an over-the-top, violent series, full of unpleasant characters. Once I started watching however, I found a beautifully written, beautifully acted drama, full of compelling three-dimensional characters. Part of what works about Narcos is that its look at the rise of the drug cartels in Colombia is told through the eyes of American DEA agent Steve Murphy. Murphy is neither saint nor sinner, but a likable, relatable figure, doing his best to make sense out of the chaos that was Colombia in the 80's. Wagner Moura's portrayal of Pablo Escobar--part evil genius, part paranoid--is nuanced and riveting. And it should be mentioned that even though men drive the story in Narcos, there is still room for interesting female characters. Unlike many shows about violent subcultures, the women are far more than simply props in Narcos. Full kudos to Netflix for producing yet another adult, intelligent show. Along with another Netflix creation, Master of None, Narcos stands as one of the top TV shows of 2015.", "review_date": "25 December 2015", "rating_value": "10"}]}, {"ImdbId": "tt2707408", "reviews": [{"reviewer_name": "Talymalah", "reviewer_url": "/user/ur31323679/", "data-review-id": "rw3370728", "short_review": "Remember How Good Breaking Bad Was? Multiply that by 10!", "full_review": "", "review_date": "12 December 2015", "rating_value": "9"}, {"reviewer_name": "kp-84843", "reviewer_url": "/user/ur94708018/", "data-review-id": "rw4435442", "short_review": "Could have been so much better", "full_review": "Having to read sub-titles is what took me away from this show. It's good show but the sub-titles are 100% unnecessary.", "review_date": "3 November 2018", "rating_value": "3"}, {"reviewer_name": "amiirrahmanii", "reviewer_url": "/user/ur123696068/", "data-review-id": "rw6040000", "short_review": "weak Director,Bad Characterizations", "full_review": "", "review_date": "29 August 2020", "rating_value": "3"}, {"reviewer_name": "LeyNS", "reviewer_url": "/user/ur8106387/", "data-review-id": "rw3809511", "short_review": "Seasons 1&2- Brilliant. Season 3-Sheer disappointment", "full_review": "", "review_date": "19 September 2017", "rating_value": ""}, {"reviewer_name": "mina-19333", "reviewer_url": "/user/ur119020052/", "data-review-id": "rw6242653", "short_review": "Bad", "full_review": "Bad series I don't love it but it just my opinion so watch a series and judge with your self", "review_date": "7 November 2020", "rating_value": "1"}, {"reviewer_name": "Master_Strange", "reviewer_url": "/user/ur111129375/", "data-review-id": "rw6568836", "short_review": "Detailed And Well Narrated Masterpiece", "full_review": "Narcos is based on real personalities and events which brilliantly crafted and well executed in this show. every single character is really interesting and well shaped, the one thing i love most about this show is the transition between the narration and actual story sequences because it helps to understand what's happening especially when there's so much going on. So it won't bore you for a second, Apart of all sci-fi and fiction stuff it was good to see something a bit political ,a bit commercial and a bit violent. Hats off to the director and cinematography.", "review_date": "6 February 2021", "rating_value": "8"}, {"reviewer_name": "j-a-julian", "reviewer_url": "/user/ur14121727/", "data-review-id": "rw6682751", "short_review": "A Great Series, Worthy of a 9 ... Except for One Thing", "full_review": "Absolutely a great series. A story well told that follows the real world story closely. Roughly 2/3rds of the dialog is appropriately in Spanish .... but herein is the root of the fatal flaw. The English subtitles OFTEN flash on and off too rapidly to read. This is a GREAT distraction. English is my first language and I can read quickly. A minor corollary, I do speak some Spanish and did notice that the English translation, in some cases, has been toned down a bit from the raw terms in the Spanish. Again, great series, well worth watching ... hard to believe that they totally blew the subtitles.", "review_date": "11 March 2021", "rating_value": "1"}, {"reviewer_name": "nkishudak", "reviewer_url": "/user/ur98269721/", "data-review-id": "rw6469093", "short_review": "Brilliant", "full_review": "I have no problem dead people, but damn...dogs and cats :((( otherwise; such a brilliant show! I am delighted to see nice male butts. This is what I live for.", "review_date": "12 January 2021", "rating_value": "10"}, {"reviewer_name": "graphchiqovani", "reviewer_url": "/user/ur67812504/", "data-review-id": "rw6362036", "short_review": "Extraordinary", "full_review": "Seris is just briliant. They can simply make you extend days and nights watching it. Love this show.", "review_date": "13 December 2020", "rating_value": "10"}, {"reviewer_name": "ahmedaiai", "reviewer_url": "/user/ur126961036/", "data-review-id": "rw6341491", "short_review": "Personal opinion", "full_review": "Only the first 2 seasons\nSeason 3 is a waste of time", "review_date": "6 December 2020", "rating_value": "8"}, {"reviewer_name": "lekkelmendi-16102", "reviewer_url": "/user/ur110748171/", "data-review-id": "rw6256304", "short_review": "Almost perfect", "full_review": "Narcos is a TV show series which tells about the criminal life of Pablo Escobar who ran the cocaine all over the Colombia and became a narcoterrorist, it's really based on true story, this is why I wanted to watch it though.\nThe narrator speaking is impressive and perfect, also Wagner Moura did the best acting alongside with other actors.\nThe reason I rated 7 not 9 or 10 is because of too much unnecessary murders, gore, and sex scenes, don't get me wrong.\nI reccommend this show to watch, liked it and was worth watching.", "review_date": "10 November 2020", "rating_value": "7"}, {"reviewer_name": "vibhavprakash-05783", "reviewer_url": "/user/ur114556149/", "data-review-id": "rw6205394", "short_review": "First 2 seasons are just awesome but last season destroyed everything..", "full_review": "First 2 seasons contain thriller ,Emotions,action But the last season is just so boaring as It's screenplay is very slow..", "review_date": "25 October 2020", "rating_value": "7"}, {"reviewer_name": "suveshtripathi", "reviewer_url": "/user/ur125492798/", "data-review-id": "rw6202965", "short_review": "Best in class", "full_review": "No one can recreate this series as good as this is.", "review_date": "24 October 2020", "rating_value": "10"}, {"reviewer_name": "rebeccamortimer-69130", "reviewer_url": "/user/ur125299342/", "data-review-id": "rw6187069", "short_review": "Great show, very exciting!", "full_review": "Huge fan of Spanish tv in general, and this show does not disappoint. Amazing acting, great cinematography. Loses a point because sometimes hard to keep track of what's going on.", "review_date": "18 October 2020", "rating_value": "9"}, {"reviewer_name": "pablo_moriano", "reviewer_url": "/user/ur28911673/", "data-review-id": "rw6176471", "short_review": "Almost 10", "full_review": "Two superb seasons and a third that,being good and enjoyable, lacks of a couple of characters who were crucial for the series what makes it quite hard to get through.", "review_date": "14 October 2020", "rating_value": "9"}, {"reviewer_name": "loversofmovies", "reviewer_url": "/user/ur57997404/", "data-review-id": "rw6160343", "short_review": "Absolutely brilliant", "full_review": "Where do I start from? Wow absolutely brilliant. Wherever, if you too want to be rich, use your brain study and obey the law. Narcos will blow you away, yes the actor is Brazilian playing Din Pablo Escobar and are aware the actor is not Colombia. Well do to everyone involved in the project.", "review_date": "9 October 2020", "rating_value": "8"}, {"reviewer_name": "supriyaan-05079", "reviewer_url": "/user/ur124619749/", "data-review-id": "rw6126084", "short_review": "Best series ever", "full_review": "", "review_date": "26 September 2020", "rating_value": "10"}, {"reviewer_name": "skepticskeptical", "reviewer_url": "/user/ur22563365/", "data-review-id": "rw6125642", "short_review": "Excellent production values, annoying narration", "full_review": "", "review_date": "26 September 2020", "rating_value": "8"}, {"reviewer_name": "Austinfung", "reviewer_url": "/user/ur99680245/", "data-review-id": "rw6112948", "short_review": "A lot of sex scenes at first....", "full_review": "", "review_date": "21 September 2020", "rating_value": "10"}, {"reviewer_name": "shafiqislam-99781", "reviewer_url": "/user/ur124219938/", "data-review-id": "rw6102301", "short_review": "The Drug Lord : Pablo Escobar", "full_review": "Narcos is brilliantly crafted. Well executed. Season 1 and 2 showed the fall of Pablo Escobar and it was one hell of a ride. This series depicts the Columbian cartels during the 80's. The entire production is superbly crafted. The construction and pacing of the narrative immerses the viewer inside the drug trafficking underbelly. The storyline revolves around the efforts of two agents from different countries working together to take down the cartels and the obstacles they faced. It addresses the drug trade from all points of view including law enforcement, politicians, traffickers, media and the victims left in the wake. What I learned from this series, narcos dealings were never be clean. Lot of people died even they are narcos members or public victims . For example, in one episode, Pablo Escobar use a young man to bring a briefcase containing bomb that explode the plane..young man died..then Pablo Escobars' people went down to the young man house and killed his beloved wife. They want to kill that baby too but the DEA agents safe them first. The most notable kingpin targeted is Pablo Escobar and unless you've been living under a rock, that name is well known. It's pure, raw and gritty. The writers made it clear during the three seasons that if you cut off the head of the snake, another figure will be standing in line to take it's place. The ending leaves the viewer with this realization and also eludes to the fact that the story is just beginning.He was a very smart person and he run his business in many types of ways,he made a lot of money ! On the other side he also made many rivals,and that cause him defeat in the end,whoever came to his path to stop him he sent his man to kill him,he killed lot of police officers in his time.he made huge property,house,cars,villa,weapons .Pablo loved his family very much,he always take care of his family. Pablo Escobar was a romantic husband to her wife, and being good to his mother..even what he did was totally wrong, but giving wealth to your family is a dream of every men in this world. You won't find terribly long and boring moments during an episode for which The Walking Dead is infamous. Narcos describes narcotrafficking in the mind of psychopath entrepreneur. It's exhilarating and terrifying. It makes you wonder what kind of tactic the narcotraffickers are going to use next to overwhelm their adversaries. Narcos is worth a watch,it is full of thrilling,entertainment and actio . Overall it's outstanding.", "review_date": "17 September 2020", "rating_value": "8"}, {"reviewer_name": "mdshifat", "reviewer_url": "/user/ur64907082/", "data-review-id": "rw6056990", "short_review": "02 September 2020", "full_review": "Biographical Crime Series About Pablo Escobar, Let's See What Happens Next", "review_date": "2 September 2020", "rating_value": "9"}, {"reviewer_name": "JackPul", "reviewer_url": "/user/ur120381810/", "data-review-id": "rw5974567", "short_review": "One of the best Crime Drama Series lately, watch it!", "full_review": "The lead actor is the center of attraction and grips the whole movie together. As an international audience this is a very addictive series. I am engaged with the characters in deep. Every sequence has an exciting element for the upcoming one. It is of course not an ordinary crime drama but a whole big realistic one with 10 on 10 cinematography. Crime lovers will love it!!!", "review_date": "8 August 2020", "rating_value": "8"}, {"reviewer_name": "susimaa", "reviewer_url": "/user/ur64907308/", "data-review-id": "rw5968696", "short_review": "Don't miss great series", "full_review": "", "review_date": "5 August 2020", "rating_value": "9"}, {"reviewer_name": "dhmsal-16750", "reviewer_url": "/user/ur102311134/", "data-review-id": "rw5965136", "short_review": "Fun I love the horses", "full_review": "I am an open minded and a woman who has been a great woman in a long way of god love it and love you and I have my son in love the new way please call me please please call me whenever", "review_date": "4 August 2020", "rating_value": "9"}, {"reviewer_name": "gauravjkandarkar", "reviewer_url": "/user/ur80827242/", "data-review-id": "rw5962984", "short_review": "A perfect crime thriller, drama series", "full_review": "The best series available on Netflix till date. A perfect crime thriller and very gripping and fun to watch with incidents revolving around real events. Epic acting by the perfect cast and so satisfying, you would constantly wish it never ends.", "review_date": "3 August 2020", "rating_value": "10"}]}, {"ImdbId": "tt2707408", "reviews": [{"reviewer_name": "glyn-25860", "reviewer_url": "/user/ur62447394/", "data-review-id": "rw5903280", "short_review": "Good up to a point", "full_review": "Season 1 and 2 of the show are excellent namely because they are about Pablo Escobar. Once he is killed in a manhunt at the end of season 2 they is nowhere for this show to go.\nSeason 3 follows a Mexican Drug Cartel that could have been anyone! The good thing about season 1 and 2 is how the show gets under the skin of Escobar and has great insight into his personal life, the politicians and the DEA who were trying to bring him down.\nThe Cali Cartel are just not that interesting and did not bring about the terror on the streets of Columbia that Escobar generated.\nAlso season 3 is predicable and it fells artificial compared to the first two seasons.", "review_date": "13 July 2020", "rating_value": "7"}, {"reviewer_name": "janoffpeter", "reviewer_url": "/user/ur29920136/", "data-review-id": "rw5895796", "short_review": "It holds up somehow", "full_review": "Despite a lot of sub par acting there are a lot of historical discrepancies and the production is enormously flawed. But the mystique of Pablo keeps things afloat. The other series depicting Pablo Escobar on Netflix is a raw less costly version of this saga of cruelty greed and narcissism. The other on is called Pablo Escobar El Patron del Maal. That is a pure Colombian TV production. Less sophisticated and a bit more soap opera like but more genuine.", "review_date": "10 July 2020", "rating_value": "7"}, {"reviewer_name": "lshu-04094", "reviewer_url": "/user/ur118463838/", "data-review-id": "rw5848212", "short_review": "All are interests, and the vast majority are similar. Whoever has mastered the advanced productivity and organizational form is the boss. A businessman can make a good relatio", "full_review": "All are interests, and the vast majority are similar. Whoever has mastered the advanced productivity and organizational form is the boss. A businessman can make a good relationship with government officials, and become the richest man from scratch. A researcher can make up data recognized by others, and become a scientist. A university teacher works hard, and many female students open houses with him. But a policeman will die if he does his duty, and a scientist will not find a job if he does not compile data.", "review_date": "23 June 2020", "rating_value": "8"}, {"reviewer_name": "fciocca", "reviewer_url": "/user/ur62460576/", "data-review-id": "rw5485555", "short_review": "An biopic about the rise and fall of two of the two most important cartels of the world", "full_review": "", "review_date": "15 February 2020", "rating_value": "7"}, {"reviewer_name": "saifkhan-27969", "reviewer_url": "/user/ur107107472/", "data-review-id": "rw5084173", "short_review": "Masterpiece but some pieces fell out", "full_review": "Biggest narcoterrorist of the world, escaping from every possible threat that seems okay because he was PABLO ESCOBAR, but what i found blunder was government didn't try to track his family to get escobar. Govt got spies, American dea, fricking army etc etc but not a single operation for his family. I think, they tried but why is this not a first priority when he was in his own jail & army try to kill him.", "review_date": "27 August 2019", "rating_value": "8"}, {"reviewer_name": "guenterfmang", "reviewer_url": "/user/ur85579214/", "data-review-id": "rw5020735", "short_review": "Close to Breaking Bad", "full_review": "I binge-watched the whole series in a weekend. To know that this basically happened in reality made it even more exciting. Fantastic acting by Wagner Moura", "review_date": "26 July 2019", "rating_value": "10"}, {"reviewer_name": "jomicks", "reviewer_url": "/user/ur69620881/", "data-review-id": "rw5013687", "short_review": "Poor acting by Wagner", "full_review": "", "review_date": "23 July 2019", "rating_value": "8"}, {"reviewer_name": "Thingamagingyy", "reviewer_url": "/user/ur97406657/", "data-review-id": "rw4564826", "short_review": "Plato o Plomo? Gold or lead? I say it's is so gold it shot me in the heart.", "full_review": "", "review_date": "6 January 2019", "rating_value": "10"}, {"reviewer_name": "xrandersontm", "reviewer_url": "/user/ur91784987/", "data-review-id": "rw4552840", "short_review": "Went high up on the hill then fell off the cliff", "full_review": "This show was rated a 9 before season 3. It was just perfect, not even close to Breaking Bad so I couldnt give it a 10 but it was a solid 9. This biography of Pablo Escobar is the best ever, well maybe, I heard Patron del mal or whatever is the best description but you cant compare it to the production of Narcos. So, the first 2 seasons are top notch, loved it. Along the show I was on the cartels side. But since pablo is gone by season 2 which isnt really a spoiler, everyone knows pablo got killed by the columbian police. In season 3 we are shown the biography of Pablos rivals, the Carti Cartel. I was on the police side this season wishing they will get caught. Anyway, the third season was a big waste of time and an 100 meters cliff fall, so it is a solid 8 due to Pablos kingdom.", "review_date": "1 January 2019", "rating_value": "8"}, {"reviewer_name": "gregberne11", "reviewer_url": "/user/ur21618942/", "data-review-id": "rw4500375", "short_review": "Muy Excellente!", "full_review": "This show is terrific with an underwhelming but still good season three pulling the rating down just a little. I thought Narcos was awesome with fantastic acting, particularly by the lead detective and Escobar (who I think deserves a ton of awards for this). The locations, sets, etc all seem very authentic and it follows the real life story better than most shows. This is a must see TV series and one of the best shows available on Netflix.", "review_date": "8 December 2018", "rating_value": "8"}, {"reviewer_name": "ahmet-77674", "reviewer_url": "/user/ur94387093/", "data-review-id": "rw4487062", "short_review": "netflix is in the best project..", "full_review": "Amazing or fantastic life is Escobar.. great actor wagner moura.. I like narcos tv series but 2015-2016. I'm narcos finished pablo dead", "review_date": "30 November 2018", "rating_value": "10"}, {"reviewer_name": "GUPTA_SANJANA", "reviewer_url": "/user/ur94839739/", "data-review-id": "rw4485946", "short_review": "Exciting and entertaining", "full_review": "One of the best i must say. I just love series nowadays. You can transport you self to nearly every situation of life and follow character for a long time. And they really use the advantages of series if you compare it to film. With the blend of macabre realism and authority by which the show tells the story, it's almost impossible not to be dazzled by Narcos. It's an honest look at the rapid spread of cocaine into the USA, as well ass the futility of the law enforcement trying to stop it. Told in interesting way that mixes both drama, reality, violence and archive footage that gives it almost a documentary feeling, Narcos is definitively a treat for fans of crime shows. 9/10", "review_date": "29 November 2018", "rating_value": "9"}, {"reviewer_name": "d32", "reviewer_url": "/user/ur26736369/", "data-review-id": "rw4476090", "short_review": "Might be the best show on Netflix", "full_review": "In credible In every way. Watch it and you can't stop! The production is wow! The action is intense! The story amazing!", "review_date": "24 November 2018", "rating_value": "10"}, {"reviewer_name": "karlstp", "reviewer_url": "/user/ur53467497/", "data-review-id": "rw4471661", "short_review": "Netflix crée un chef d'oeuvre d'une saison a l'autre", "full_review": "Magnifico. Tout simplement dans mes meilleurs séries à vie.", "review_date": "21 November 2018", "rating_value": "10"}, {"reviewer_name": "wapgalaxy", "reviewer_url": "/user/ur89831460/", "data-review-id": "rw4470827", "short_review": "Best in its class..!", "full_review": "One of the best Crime show. Pablo always step ahead with his menace. Loved the show.", "review_date": "21 November 2018", "rating_value": "10"}, {"reviewer_name": "zayedshaikh672", "reviewer_url": "/user/ur56295682/", "data-review-id": "rw4461438", "short_review": "Awsume", "full_review": "Its good story u should watch it.so much choas.I love Netflix", "review_date": "16 November 2018", "rating_value": "10"}, {"reviewer_name": "GrandoFernando", "reviewer_url": "/user/ur7370608/", "data-review-id": "rw4446389", "short_review": "Superb", "full_review": "", "review_date": "9 November 2018", "rating_value": "10"}, {"reviewer_name": "envysalonkl", "reviewer_url": "/user/ur94390414/", "data-review-id": "rw4430941", "short_review": "Justa great show", "full_review": "", "review_date": "1 November 2018", "rating_value": "8"}, {"reviewer_name": "Iknowbest", "reviewer_url": "/user/ur84067155/", "data-review-id": "rw4380521", "short_review": "Intriguing series", "full_review": "I like where Netflix has gone - taking foreign language series and putting them at the forefront of binge TV. I love this show and truly cannot wait to see the next season.", "review_date": "6 October 2018", "rating_value": "9"}, {"reviewer_name": "GrandoFernando", "reviewer_url": "/user/ur7370608/", "data-review-id": "rw4362123", "short_review": "Absolutely Superb", "full_review": "", "review_date": "26 September 2018", "rating_value": "10"}, {"reviewer_name": "rayah-kh", "reviewer_url": "/user/ur54488631/", "data-review-id": "rw4330168", "short_review": "Magnificent!!", "full_review": "", "review_date": "9 September 2018", "rating_value": "10"}, {"reviewer_name": "DagRos", "reviewer_url": "/user/ur90308370/", "data-review-id": "rw4311858", "short_review": "A mesmerizing and frightening journey into life of the famous druglords", "full_review": "", "review_date": "30 August 2018", "rating_value": "9"}, {"reviewer_name": "v-ley", "reviewer_url": "/user/ur22875108/", "data-review-id": "rw4311400", "short_review": "Very good for a drug lord's story", "full_review": "I've only seen season one, renting season 2 now. I've enjoyed what I've watched so far. Nothing is \"glamorized\" which makes it worthwhile.\nI didn't like the \"Godfather\" movies for that very reason. Brutality, violence and pure evil lives in men all around the World, it's time to put a spotlight on those that think they are above the law but fall very short of it, without making them romanticized or heroic because they are not.\nThis is a very interesting story in our American history.", "review_date": "30 August 2018", "rating_value": "7"}, {"reviewer_name": "andrejmitrovski", "reviewer_url": "/user/ur67841071/", "data-review-id": "rw4307300", "short_review": "Best TV serie i have ever watched", "full_review": "I rarely watch tv shows and series but i just had to start this one !\nIts epic,its about the biggest ever cocain dealer and everything about his life.Before he became a dealer,during the time he was and after him,i have only one thing to say about it - You MUST Watch This Thing.", "review_date": "27 August 2018", "rating_value": "10"}, {"reviewer_name": "MohammedFakhry", "reviewer_url": "/user/ur86448694/", "data-review-id": "rw4304981", "short_review": "One of the most exciting shows", "full_review": "I fell In love with this show from the first season, which is the best season, and it started declining as seasons started airing.. this is perhaps why they chose to start with a whole new show named Narcos: Mexico. Instead of simply just adding a new season to a very popular show.\nThis show is very recommended.. don't hesitate to watch it.. yet Netflix needs to know that they need to make it better as seasons go, not the opposite.", "review_date": "26 August 2018", "rating_value": ""}]}, {"ImdbId": "tt2707408", "reviews": [{"reviewer_name": "henryshear", "reviewer_url": "/user/ur89269798/", "data-review-id": "rw4296766", "short_review": "An Amazing Look Into The World of Drugs!", "full_review": "", "review_date": "21 August 2018", "rating_value": "9"}, {"reviewer_name": "kshahsky", "reviewer_url": "/user/ur91303459/", "data-review-id": "rw4288056", "short_review": "Realistic raw and gritty", "full_review": "Superb acting by all and wonderful locales with a real story line. Wow!\nMost of this is on Spanish but then who cares when this series grabs you by the small hair and drags you through its ups and downs.\nVery addictive.\nSort of frightening too because this is a real story", "review_date": "16 August 2018", "rating_value": "9"}, {"reviewer_name": "stephi_dio", "reviewer_url": "/user/ur64356636/", "data-review-id": "rw4276427", "short_review": "Amazing", "full_review": "There is obviously the dramatisation to keep ratings on the high, but overall a great series at it combines the real footage with the acting ones!", "review_date": "9 August 2018", "rating_value": "9"}, {"reviewer_name": "mukherjeesubham93", "reviewer_url": "/user/ur54369156/", "data-review-id": "rw4271284", "short_review": "Moura is Escobar!", "full_review": "The show takes it time setting up the story. There are obvious genre conventions and stuff. But around the halfway mark of the first season, this show becomes unputdownable, and the prime reason for this is Wagner Moura as Pablo Escobar. It is a delight witnessing the actor sink his teeth into the character, and make you root for him even when you see him doing various grisly deeds. The 2nd season was even more intense. By then, the makers knew who the real star of the show was, and they designed the second season accordingly and Moura once again, was excellent. Overall, a well made show, which stands apart from others because of the mesmerizing performance of it's central character. I haven't watched the third season despite glowing reviews just because of this fact that i couldn't imagine Narcos without Moura.", "review_date": "6 August 2018", "rating_value": "9"}, {"reviewer_name": "pivoway", "reviewer_url": "/user/ur87081583/", "data-review-id": "rw4261006", "short_review": "Real", "full_review": "This is a great series, because its have reality. The actors are the best!", "review_date": "30 July 2018", "rating_value": "10"}, {"reviewer_name": "k_tito_trinidad", "reviewer_url": "/user/ur5336372/", "data-review-id": "rw4260447", "short_review": "Brilliant", "full_review": "", "review_date": "30 July 2018", "rating_value": "10"}, {"reviewer_name": "coolneer0810", "reviewer_url": "/user/ur39094314/", "data-review-id": "rw4248471", "short_review": "It's all good till it's Pablo", "full_review": "I watched Narcos over a few months, and the storyline is incredibly interesting - that is, until Pablo Escobar dies (no spoilers there). I really enjoyed Wagner's acting and how interesting the person he portrayed was in actual life. But after Pablo's death, the storyline got a bit mundane for me (other than the brilliant acting of Alberto Ammann), and I ultimately didn't get through the third season.", "review_date": "22 July 2018", "rating_value": "8"}, {"reviewer_name": "nellisam", "reviewer_url": "/user/ur71227014/", "data-review-id": "rw4231482", "short_review": "Very Interesting", "full_review": "I don't like this kind of movies/series at large apart from that!", "review_date": "9 July 2018", "rating_value": "10"}, {"reviewer_name": "drazen-275-272120", "reviewer_url": "/user/ur30881994/", "data-review-id": "rw4215875", "short_review": "Simply great", "full_review": "Everything is just perfect - storyline, casting, music. I love this one", "review_date": "25 June 2018", "rating_value": "10"}, {"reviewer_name": "mehtavineet", "reviewer_url": "/user/ur86908914/", "data-review-id": "rw4197714", "short_review": "Superb and excellently scripted", "full_review": "", "review_date": "10 June 2018", "rating_value": "10"}, {"reviewer_name": "me_sweety", "reviewer_url": "/user/ur84920605/", "data-review-id": "rw4186525", "short_review": "The most satisfying biographical series I have ever seen", "full_review": "So there are a few things about this shows direction which just make it amazing. Firstly, its historically very accurate, secondly, they have tried very hard to maintain the realism by making sure Pablo doesnot look or speak like what he didnot in real life. He and all the other Columbian characters speak in Spanish which adds a really realistic charm to the show, he is rotund and deadly just like he looked in real life (hell one can compare this with Tudors where Henry V had abs -__-) moreover, the narration, the acting and the tiny snippets they add from actual historical footages makes the show seem pretty realistic. I absolutely love all the actors ranging from Gustav and Pablo to Agent Murphy and Carillo. God, I love the way they have presented all the characters; Carillo, Murphy, Gabrielle, Pablo. It was difficult to not fall in love with them. I know this is probably a very poorly written review but this show is amazing and one should watch it.", "review_date": "1 June 2018", "rating_value": "9"}, {"reviewer_name": "lukeenshaw", "reviewer_url": "/user/ur82887310/", "data-review-id": "rw4126201", "short_review": "Very gripping.", "full_review": "", "review_date": "12 April 2018", "rating_value": "8"}, {"reviewer_name": "gazface", "reviewer_url": "/user/ur10374067/", "data-review-id": "rw4117015", "short_review": "Entertaining show, solid performances, terrible accents.", "full_review": "", "review_date": "4 April 2018", "rating_value": "8"}, {"reviewer_name": "shahrzadpendari", "reviewer_url": "/user/ur83073174/", "data-review-id": "rw4091106", "short_review": "\"Yo Soy Pablo Emilio Escobar Gaviria\"", "full_review": "When I started watching this, I really didn't have big expectations. I thought this was going to be one of those white washed Americanized series that doesn't focus on the real story and just shows a bunch of gringo police officers and a few shots of Wagner Moura for dessert.\nBoy I was wrong!\nthis series is lit, well written and well documented. also great actors who really can pull off their roles,and the best parts is that this series is still great after 3 seasons! even in my opinion the third season was very much better than the second season. the reason I gave this one 9 instead of 10, was because I was tired of Boyd Hollbrock's and Pedro Pascal's narratives through the story.\nCan't wait to watch season 4!", "review_date": "14 March 2018", "rating_value": "9"}, {"reviewer_name": "vitmiro", "reviewer_url": "/user/ur64520833/", "data-review-id": "rw4058048", "short_review": "Couldn't take my eyes off from the screen", "full_review": "When I first watched Narcos didn't have much expectation about this TV show. But then I watched the first, the second, the third episode and when I realized, I had finished the second season of it. I'd say the best actuation is in Wagner Moura as Pablo Escobar, and Pedro Pascal as Penã. \nIts plot is grounded in real facts, some parts are fictional, but still really shocking, intriguing and surrounding. I'd say is the best action TV serie I have ever seen. To be honest I don't know if it shows the reality of the ancient Colombia nor the current, but I'm sure the environment that involve Narcos (full of gangs, weapons, drugs, violence, affairs, revenges and money) is completely breathtaking.\nFurthermore, something that is really interesting is the presence (in the 2 first seasons) of two sides of Escobar: the one that shows a man who is totally devoted to his family, a great husband and father which is always worried with his family's welfare, and the side of a murderer where Escobar is a frigid, spiteful, wicked man. This show is so well written that this two sides of the man are really intrinsic and couldn't exist without the other. This is just one part of the spetacular charachters and how their constructions is well done. A great TV serie.", "review_date": "10 February 2018", "rating_value": "10"}, {"reviewer_name": "mattdasilva-34182", "reviewer_url": "/user/ur85263002/", "data-review-id": "rw4057103", "short_review": "Masterpiece", "full_review": "", "review_date": "8 February 2018", "rating_value": "10"}, {"reviewer_name": "traseeh", "reviewer_url": "/user/ur36452058/", "data-review-id": "rw3856656", "short_review": "Great TV Show with even greater acting", "full_review": "", "review_date": "13 November 2017", "rating_value": "9"}, {"reviewer_name": "lacatusalexandru", "reviewer_url": "/user/ur68105488/", "data-review-id": "rw3799834", "short_review": "Still one of the best TV shows from Netfilx", "full_review": "This show doesn't stop from surprise us with magnificent episodes that keeps you in suspense as well as making you watching all of them fast to know what's going to happen.After the first 2 seasons that I've seen,I can say that the 3rd season is as good as the previous and it's definitely more intense and every episode surprise you with unexpected events.Another interesting thing is that the season 3 is focusing more on the Pedro Pascal's character(Javier Pena) and on his character's evolution and the hard choices that his character has to make.Even though this season isn't at all with Boyd Holbrook's character(Steve Murphy),it's still a great season,full with awesome new characters that are played very good by the actors of the show.The only question that I have is how many seasons can Netflix do for this show because after 2 seasons with the greatest drug dealer and the greatest villain of the show(Pablo Escobar) and season 3 with the Cali Cartel family,I don't think that they have another well known drug dealer as well as another great villain for the show,except El Chapo.But after they will do a season with El Chapo than the show it's kinda finished because they are getting way too close to the 2000 year and after that they don't have any notorious drug lord to ad for their season,not to mention that without Javier Pena or Steve Murphy the show will turn from great into goring and bad.", "review_date": "7 September 2017", "rating_value": "10"}, {"reviewer_name": "jan-07680", "reviewer_url": "/user/ur70038949/", "data-review-id": "rw3605155", "short_review": "outstanding acting", "full_review": "", "review_date": "24 December 2016", "rating_value": "10"}, {"reviewer_name": "valessa-22089", "reviewer_url": "/user/ur69194966/", "data-review-id": "rw3558098", "short_review": "Narcos took over my life. Great show indeed", "full_review": "I was looking for a new series to watch and came across Narcos. There was some hype about it when it premiered but I never gave it time of day till recently. I couldn't believe I had deprived myself of such greatness this long. This show is beautifully cast, written, acted and is pure perfection. I have been glued to my laptop screen and have pretty much become obsessed. There is so much to love about this show and it only gets better by the seasons. Can't wait to see what the writes and directors have in store for us going forward. Such a great, amazing and captivating show. I would urge you to watch it NOW if you haven't joined the club yet ;)", "review_date": "8 October 2016", "rating_value": "10"}, {"reviewer_name": "googlinit", "reviewer_url": "/user/ur69057317/", "data-review-id": "rw3552149", "short_review": "Great visual production, hard to decipher story line.", "full_review": "Possible spoiler: Narcos is a Great gripping visual production, but don't depend on this to maintain a consistent story line. Previous knowledge of the affairs shown is necessary. Dialog is trendy minimalist. English dialog, particularly with the 2 DEA agents necessary to follow the story was unintelligible and garbled. Possibly this could be a problem in sound compression in Netflix streaming. Spanish dialog I could understand due to subtitles. Also, there is X rated material inserted, although brief. For these reasons, I gave it a lower rating, although, as mentioned a gripping production. Scenes on location, ethnic actors and actresses & choreography add to the realism, making you feel you are in the scenes.", "review_date": "28 September 2016", "rating_value": "5"}, {"reviewer_name": "ola-37345", "reviewer_url": "/user/ur68947700/", "data-review-id": "rw3547676", "short_review": "Great characters + Dramatic Licenses = NARCOS", "full_review": "Narcos is another great Netflix's original series and I could say that is as good as House of Cards. Great characters + great techniques + some dramatic licenses brings us one of the most interesting TV series nowadays. The series show us the war on drugs in a very realistic way, without idealism or many \"hollywoodzation\". We can actually feel the Escobar's power and all the tension that Colombia lived. Like The Walking Dead and Game of Thrones, it's not recommended get attached in some character, because a lot of them will die. If you want to see some techniques and references used in the show (no spoilers), check it out: youtu.be/Hokn3kkT_DQ", "review_date": "20 September 2016", "rating_value": "10"}, {"reviewer_name": "rahilpathan", "reviewer_url": "/user/ur60391058/", "data-review-id": "rw3546096", "short_review": "Awesome TV Series, I Love it!", "full_review": "", "review_date": "17 September 2016", "rating_value": "10"}, {"reviewer_name": "arsen_al90", "reviewer_url": "/user/ur27715285/", "data-review-id": "rw3542674", "short_review": "An authentic must see show that gives viewers a consistent, non-exploitative look at the world of drug smuggling", "full_review": "", "review_date": "12 September 2016", "rating_value": "9"}, {"reviewer_name": "fransezomer", "reviewer_url": "/user/ur62835083/", "data-review-id": "rw3539408", "short_review": "Love it, but with few flaws...", "full_review": "", "review_date": "7 September 2016", "rating_value": "9"}]}, {"ImdbId": "tt2707408", "reviews": [{"reviewer_name": "Spectralian", "reviewer_url": "/user/ur54926286/", "data-review-id": "rw3538916", "short_review": "Very good show overall, but some scenes are unnecessary", "full_review": "", "review_date": "6 September 2016", "rating_value": "9"}, {"reviewer_name": "mickairnes", "reviewer_url": "/user/ur66142426/", "data-review-id": "rw3538876", "short_review": "Epic Story, filled with action, heartbreak and triumph.", "full_review": "Really enjoyed the first two seasons. Mainly due to the performance given by Wagner Moura. Due to the first season going pretty much the full way into the Escobar story, ending with escape from La Catedral, season 2 was always going to end with the death of the kingpin. Although the 10 episodes were filled with action, heartbreak and triumph. The scene I enjoyed the most was in the final episode when Pablo has a conversation with his dead cousin Gustavo on a park bench. In that scene we are made to be sympathetic towards Pablo, seeing him at his most weakest. The ending of the season sets the series up for further seasons focused on the Cali Cartel after Pablo's demise. Here's hoping the series get renewed and we get to see further Narcos madness.", "review_date": "6 September 2016", "rating_value": "9"}, {"reviewer_name": "diegovillegasvera", "reviewer_url": "/user/ur64341858/", "data-review-id": "rw3538109", "short_review": "Best show I have ever watched.", "full_review": "I don't understand how this show is rated 8.9 and not 10.0 on IMDb. The moment the second season premiered at night I watched it right away. It is the best show I have ever seen and my heart was racing at the end when they killed Escobar. The suspense, the action, the emotions I felt through watching this is unexplainable. I binged the first season several amount of times I lost count! This should be named the greatest TV series in the world! I can not wait for a third season!!! who will be the next villain?? El Chapo?? Who knows but I can't wait for another season! Another binge added to the list! Best show in the world 10 out of 10! Plata o Plomo?", "review_date": "4 September 2016", "rating_value": "10"}, {"reviewer_name": "arielbuchanan61", "reviewer_url": "/user/ur52507969/", "data-review-id": "rw3461949", "short_review": "The Best Thing On Netflix", "full_review": "I just got Netflix couple weeks ago and i have been watching a lot of documentaries and other random stuff. When i came across NARCOS, I thought it was a documentary but I quickly realized it wasn't. This should be on TV but because of some of the nudity, which took me by surprise, I understand why they cant show this on TV. The production is amazing. The story-line is spectacular. The blend of real facts and some made up is amazing. You can't even tell whats real or whats made up. I am really upset because season 2 is so far away and I am on the last episode. :( But i will be waiting for this to come back on. If you haven't watched......you need to. This show is the best show I have ever seen so far.", "review_date": "2 May 2016", "rating_value": "10"}, {"reviewer_name": "nicola-170", "reviewer_url": "/user/ur15996732/", "data-review-id": "rw3435230", "short_review": "Strong as the man who's story is told", "full_review": "", "review_date": "21 March 2016", "rating_value": "10"}, {"reviewer_name": "umerzaman", "reviewer_url": "/user/ur62680144/", "data-review-id": "rw3408979", "short_review": "F***king hell of TV show", "full_review": "", "review_date": "5 February 2016", "rating_value": "10"}, {"reviewer_name": "TheParatrooper", "reviewer_url": "/user/ur37801945/", "data-review-id": "rw3399218", "short_review": "10/10", "full_review": "Extremely interesting and attracting movie that I highly recommend to all the movie fans out there! It has a lot of interesting scenes and videos from real reports on television that makes the movie even more and more interesting, plus the fact that there is all the time movie speaker that involves you more and more with the story itself. If you are fan of the dark deals and crime scenes this is the movie for you. The actors are playing very well specially the main actor that plays Pablo Escobar. My opinion about himself is that he have very good deep voice and he is the perfect choice for the role given by the Directors of the movie.", "review_date": "20 January 2016", "rating_value": "10"}, {"reviewer_name": "blazingwater02", "reviewer_url": "/user/ur33570243/", "data-review-id": "rw3398944", "short_review": "Narcos, hola Senorias!", "full_review": "One of the best series I have seen in recent years. One of my Spanish friend recommended it to watch, and as I started I got to know why. I spent like 80% of the time reading the Spanish translations. Lol. But, boy oh boy, what a series, I got hooked onto it so much that, I finished 1st season in 2 days, and I must accept I am dumb enough to do that cus next season is not airing so soon...I never knew anything about Columbia, just that they speak Spanish and have most beautiful women in the world. Pablo Escobar was the 10th richest man in the world at the peak of his career with estimated assets of about 30billion dollars, making him the richest criminal in the history. Muchas gracias Netflix for such as awesome series, appreciate it.", "review_date": "20 January 2016", "rating_value": "9"}, {"reviewer_name": "pauliusbeta-31528", "reviewer_url": "/user/ur64057096/", "data-review-id": "rw3363333", "short_review": "mistake", "full_review": "Serial is quite interesting, but I think there are much mistakes. Many characters shown like stupid idiots, but if they were so stupid how they could build cocaine empire with billions profit? And I found one big mistake of director work, was interesting to see Pablo paramour journalist, that was going to Pablo with BMW 5 series of 1996 year (Pablo died at 1993m). 8 part 43min 28s. But speaking about serial generally, it makes viewer to think about this black business and results of trying to control every one by fear and money help. You could control many people, but not all. In all times will be honest and brave men and women. I would like to wish good time of watching this serial.", "review_date": "29 November 2015", "rating_value": "9"}, {"reviewer_name": "xcvb_2003", "reviewer_url": "/user/ur8202613/", "data-review-id": "rw3362027", "short_review": "Well developed crime drama series. Season 1 review.", "full_review": "", "review_date": "27 November 2015", "rating_value": "8"}, {"reviewer_name": "hitesh-p-shetty", "reviewer_url": "/user/ur52815562/", "data-review-id": "rw3361663", "short_review": "Descenso Review.", "full_review": "", "review_date": "26 November 2015", "rating_value": "6"}, {"reviewer_name": "sooperklew", "reviewer_url": "/user/ur26660129/", "data-review-id": "rw3347977", "short_review": "Starts good ends better 9/10.", "full_review": "", "review_date": "2 November 2015", "rating_value": "9"}, {"reviewer_name": "Javier29", "reviewer_url": "/user/ur53539284/", "data-review-id": "rw3343221", "short_review": "Action, Plot, Real events ..Worth to see it", "full_review": "", "review_date": "25 October 2015", "rating_value": "8"}, {"reviewer_name": "Aqeel_M", "reviewer_url": "/user/ur56898861/", "data-review-id": "rw3332905", "short_review": "Highly Addicting", "full_review": "", "review_date": "10 October 2015", "rating_value": "10"}, {"reviewer_name": "shasankkonichiwa", "reviewer_url": "/user/ur21075687/", "data-review-id": "rw3328619", "short_review": "An economics of faster but substantial encroachment in narcotics from a poor country to a rich country", "full_review": "", "review_date": "4 October 2015", "rating_value": "10"}, {"reviewer_name": "mhikmetaltug", "reviewer_url": "/user/ur3099722/", "data-review-id": "rw3325397", "short_review": "Narcos; The Naked Truth Cold as Pablo Escobar.", "full_review": "", "review_date": "28 September 2015", "rating_value": "9"}, {"reviewer_name": "bruceascott", "reviewer_url": "/user/ur62570903/", "data-review-id": "rw3314259", "short_review": "Tops Sopranos", "full_review": "Its a must-see if you want to see the historical madness of organized crime and the political challenges for everyone involved back in the eighties. The cast is superb. I am a little shocked by the amount of nudity that is now allowed on television but that is just a reminder that I am now getting old and that this decade is far far different than the eighties. It is interesting to see the very primitive ways in which the CIA had to monitor people. Of course today, with smart phones everywhere, satellites and the internet, cameras on many street cameras there is virtually no privacy. Having said that, this is a very positive technological development because the ethical values of society have slide down the mountain about 50 feet from 50 years ago. CHEERS .... still a must see .... better than most movies .... very educational.", "review_date": "10 September 2015", "rating_value": ""}, {"reviewer_name": "l_carolina", "reviewer_url": "/user/ur62556059/", "data-review-id": "rw3313700", "short_review": "Not so shabby", "full_review": "I've seen a lot of documentaries about Pablo Escobar, which are all very interesting, but I love how this one is narrated by a different point of view. I love the rawness of the narrator. I was pretty disappointed with who they used for Pablo. In real life, he was a man that gave you a sense of fear and dominance. I didn't get that feeling from this actor. Probably because he had a horrible paisa accent. His Spanish was actually hard to understand sometimes. Being the main character of the series, I thought that was a very poor choice the makers made; which is the reason I didn't rate this series higher. For non-Spanish speakers, it's irrelevant, but I would've loved to get the full effect of a true paisa. I guess that's what the subtitles are for!", "review_date": "9 September 2015", "rating_value": "7"}, {"reviewer_name": "joellwhite", "reviewer_url": "/user/ur62454897/", "data-review-id": "rw3310335", "short_review": "Language Issue.", "full_review": "", "review_date": "3 September 2015", "rating_value": "8"}, {"reviewer_name": "ramjua", "reviewer_url": "/user/ur60866723/", "data-review-id": "rw3307798", "short_review": "this is a good series. Most of the actors did a commendable job", "full_review": "This is a good series. Most of the actors did a commendable job (Including Dustin Hoffman as Tootsie as Pablo's mom). Although I do understand that Netflix wants to appeal to a global viewership, I must admit that the inaccuracy of many of the accents was very distracting. So it was the lack of Spanish fluency in some of the actors \"forced\" to speak in Spanish. Also, I do not agree with some of the nativist comments -nor endorse English as the lingua franca- but the bilingual format was not very successful -in my view. Production values are high but I have seen several Colombian narco telenovelas that are better product than Narcos. Entertaining yet not Netflix best product.", "review_date": "29 August 2015", "rating_value": "8"}]}]}